// Гарант+ Килипенко 14.01.2025 [F00233364] Отчет ОСВ по услугам ++
#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - ТабличныйДокумент
Функция СформироватьТабличныйДокументАктаОСВПоEckeufvПоДаннымЗаполнения(
        Знач ДанныеЗаполненияТЧ, Знач ДанныеЗаполненияШапки, Знач ТабличныйДокумент = Неопределено, Знач МакетАкта = Неопределено) Экспорт

    УстановитьПривилегированныйРежим(Истина);

    МакетАкта = ?(МакетАкта = Неопределено, ПолучитьМакетаАктаОСВПоАбоненту(), МакетАкта);

    ТабличныйДокумент = ?(ТабличныйДокумент = Неопределено, Новый ТабличныйДокумент, ТабличныйДокумент);
    ТабличныйДокумент.ПолеСлева = 5;
    ТабличныйДокумент.ПолеСправа = 5;
    ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
    ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
    ТабличныйДокумент.АвтоМасштаб = Истина;
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.ТолькоПросмотр = Истина;

    ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ГП_ОСВПоУслугам_АктСверкиПоУслугам";

    Если ДанныеЗаполненияТЧ.Строки.Количество() = 0 Тогда
        // Документ без данных
        ОбщегоНазначения.СообщитьПользователю("Данные отсутствуют");
        Возврат ТабличныйДокумент;
    КонецЕсли;

    // Общие реквизиты шапки
    ОбластьШапки = МакетАкта.ПолучитьОбласть("Заголовок");

    // Данные участников
    СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(
            ДанныеЗаполненияШапки.Организация, ДанныеЗаполненияШапки.ДатаАктаСверки);
    НазваниеОрганизации = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;

    // СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(
    //         ДанныеЗаполненияШапки.Контрагент, ДанныеЗаполненияШапки.ДатаАктаСверки);
    // НаименованиеКонтрагента = СведенияОКонтрагенте.НаименованиеДляПечатныхФорм;
    // ОбластьШапки.Параметры.НаименованиеКонтрагента = НаименованиеКонтрагента;

    // За период
    ДатаНачалаОтчета = ДанныеЗаполненияШапки.ДатаНачала;
    Если ЗначениеЗаполнено(ДатаНачалаОтчета) Тогда
        ЗаПериод = ПредставлениеПериода(НачалоДня(ДатаНачалаОтчета), КонецДня(ДанныеЗаполненияШапки.ДатаОкончания), "ФП = Истина");
        ОбластьШапки.Параметры.ЗаПериод = СтрШаблон(НСтр("ru='за период: %1'"), ЗаПериод);
    КонецЕсли;

    ТабличныйДокумент.Вывести(ОбластьШапки);

    НомерСтроки = 0;
    Для Каждого СтрокаДанныхКонтрагента Из ДанныеЗаполненияТЧ.Строки Цикл
        НомерСтроки = НомерСтроки + 1;

        // // Создаем массив для проверки вывода
        // МассивВыводимыхОбластей = Новый Массив;

        // Получаем макеты остатков
        ОбластьЗаголовокТаблицы = МакетАкта.ПолучитьОбласть("ЗаголовокТаблицы");
        ОбластьНачальноеСальдо = МакетАкта.ПолучитьОбласть("НачОстатки");
        ОбластьОбороты = МакетАкта.ПолучитьОбласть("ОборотыИтог");
        ОбластьКонечноеСальдо = МакетАкта.ПолучитьОбласть("КонОстатки");

        // Остатки и обороты
        ДанныеЗаполненияИтогов = СтрокаДанныхКонтрагента;
        ОбластьНачальноеСальдо.Параметры.Заполнить(ДанныеЗаполненияИтогов);
        ОбластьОбороты.Параметры.Заполнить(ДанныеЗаполненияИтогов);
        ОбластьКонечноеСальдо.Параметры.Заполнить(ДанныеЗаполненияИтогов);

        // Контрагент
        СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(
            ДанныеЗаполненияТЧ.Контрагент, ДанныеЗаполненияШапки.ДатаАктаСверки);
        НаименованиеКонтрагента = СведенияОКонтрагенте.НаименованиеДляПечатныхФорм;
        ОбластьНачальноеСальдо.Параметры.НаименованиеКонтрагента = НаименованиеКонтрагента;
        ОбластьНачальноеСальдо.Параметры.Контрагент = ДанныеЗаполненияТЧ.Контрагент;

        Если НомерСтроки = 1 Тогда
            ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
        КонецЕсли;

        ТабличныйДокумент.Вывести(ОбластьНачальноеСальдо);
        МассивОбластейДетальныхЗаписей = ЗаполнитьТаблицуДокументаПоКонтрагенту(
            СтрокаДанныхКонтрагента, ДанныеЗаполненияШапки, ТабличныйДокумент, МакетАкта);
        Для каждого ОбластьДетальнойЗаписи Из МассивОбластейДетальныхЗаписей Цикл
            ТабличныйДокумент.Вывести(ОбластьДетальнойЗаписи);
        КонецЦикла;
        ТабличныйДокумент.Вывести(ОбластьКонечноеСальдо);
    КонецЦикла;

    ОбластьПодвала = МакетАкта.ПолучитьОбласть("Подвал");
    ОбластьПодвала.Параметры.Заполнить(ДанныеЗаполненияШапки);
    ОбластьПодвала.Параметры.ФИОРуководителя = ПолучитьФИОРуководителя(
        ДанныеЗаполненияШапки.Организация, ДанныеЗаполненияШапки.ДатаАктаСверки);
    ОбластьПодвала.Параметры.ФИОГлБухгалтера = ПолучитьФИОГлавногоБухгалтера(
        ДанныеЗаполненияШапки.Организация, ДанныеЗаполненияШапки.ДатаАктаСверки);
    ОбластьПодвала.Параметры.НазваниеОрганизации = НазваниеОрганизации;
    ТабличныйДокумент.Вывести(ОбластьПодвала);

    Если ПривилегированныйРежим() Тогда
        УстановитьПривилегированныйРежим(Ложь);
    КонецЕсли;

    Возврат ТабличныйДокумент;
КонецФункции

// Возвращаемое значение:
//  - ТабличныйДокумент
Функция ПолучитьМакетаАктаОСВПоАбоненту() Экспорт
    Возврат Отчеты.ГП_ОСВПоАбоненту.ПолучитьМакет("ПФ_MXL_АктСверкиПоУслугам");
КонецФункции

Функция ПолучитьФИОГлавногоБухгалтера(Знач Организация, Знач ДатаАктуальности)
    Возврат ГП_РаботаСОтчетами.ПолучитьФИОПредставителя(
        "ГлавныйБухгалтерФИО", Организация, ДатаАктуальности);
КонецФункции

Функция ПолучитьФИОРуководителя(Знач Организация, Знач ДатаАктуальности)
    Возврат ГП_РаботаСОтчетами.ПолучитьФИОПредставителя(
        "Директор", Организация, ДатаАктуальности);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 14.01.2025 [F00233364] Отчет ОСВ по услугам --

// Гарант+ Килипенко 14.01.2025 [F00233364] Отчет ОСВ по услугам ++
#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьТаблицуДокументаПоКонтрагенту(
        Знач ДанныеЗаполненияТЧ, Знач ДанныеЗаполненияШапки,
        Знач ТабличныйДокумент = Неопределено, Знач МакетАкта = Неопределено)

    РезультатФункции = Новый Массив;

    НомерСтроки = 0;
    Для Каждого СтрокаДанныхТЧ Из ДанныеЗаполненияТЧ.Строки Цикл
        НомерСтроки = НомерСтроки + 1;

        ОбластьМакета = МакетАкта.ПолучитьОбласть("Обороты");
        ОбластьМакета.Параметры.Заполнить(СтрокаДанныхТЧ);

        РезультатФункции.Вставить(ОбластьМакета);
    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 14.01.2025 [F00233364] Отчет ОСВ по услугам --
