#Область ПрограммныйИнтерфейс

// Параметры:
//  Отчет - ОтчетОбъект
//  Наименование - Строка
Функция ПолучитьПараметрПоНаименованию(Знач Отчет, Знач Наименование) Экспорт
    РезультатФункции = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
            Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, Наименование);
    Если РезультатФункции = Неопределено Тогда
        РезультатФункции = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
                Отчет.КомпоновщикНастроек.Настройки, Наименование);
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  Отчет - ОтчетОбъект
//  Наименование - Строка
//  ЗначениеПоУмолчанию - Произвольный
//  ТолькоИспользуемый - Булево
// Возвращаемое значение:
//  Произвольный, Неопределено
Функция ПолучитьЗначениеПараметраПоНаименованию(
        Знач Отчет, Знач Наименование, Знач ЗначениеПоУмолчанию = Неопределено, Знач ТолькоИспользуемый = Истина) Экспорт

    НайденныйПараметр = ПолучитьПараметрПоНаименованию(Отчет, Наименование);
    Если НайденныйПараметр = Неопределено Тогда
        Возврат ЗначениеПоУмолчанию;
    КонецЕсли;

    Если ТолькоИспользуемый = Истина И НайденныйПараметр.Использование = Ложь Тогда
        Возврат ЗначениеПоУмолчанию;
    Иначе
        Возврат НайденныйПараметр.Значение;
    КонецЕсли;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
