// Гарант+ Килипенко 05.11.2024 [F00230266] Отчет по шифрам ++
#Область ПрограммныйИнтерфейс

// Параметры:
//  Отчет - ОтчетОбъект
//  Наименование - Строка
//  СтандартныйАлгоритм - Булево - Используется как временное решение для постепенного перехода на стандартный алгоритм
Функция ПолучитьПараметрПоНаименованию(Знач Отчет, Знач Наименование, Знач СтандартныйАлгоритм = Ложь) Экспорт
    РезультатФункции = Неопределено;

    Если СтандартныйАлгоритм = Истина Тогда
        РезультатФункции = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
                Отчет.КомпоновщикНастроек, Наименование);
    Иначе
        РезультатФункции = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
                Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, Наименование);
        Если РезультатФункции = Неопределено Тогда
            РезультатФункции = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
                    Отчет.КомпоновщикНастроек.Настройки, Наименование);
        КонецЕсли;
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  Отчет - ОтчетОбъект
//  Наименование - Строка
//  ЗначениеПоУмолчанию - Произвольный
//  ТолькоИспользуемый - Булево
// Возвращаемое значение:
//  Произвольный, Неопределено
Функция ПолучитьЗначениеПараметраПоНаименованию(
        Знач Отчет, Знач Наименование, Знач ЗначениеПоУмолчанию = Неопределено, Знач ТолькоИспользуемый = Истина) Экспорт

    НайденныйПараметр = ПолучитьПараметрПоНаименованию(Отчет, Наименование);
    Если НайденныйПараметр = Неопределено Тогда
        Возврат ЗначениеПоУмолчанию;
    КонецЕсли;

    Если ТолькоИспользуемый = Истина И НайденныйПараметр.Использование = Ложь Тогда
        Возврат ЗначениеПоУмолчанию;
    Иначе
        Возврат НайденныйПараметр.Значение;
    КонецЕсли;
КонецФункции

// Параметры:
//  НаименованиеНоменклатурнойГруппы - Строка
//  ПоУмолчанию - Строка, Неопределено
//  НегативноеВоздействиеКакСток - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьПредставлениеНаименованияНоменклатурнойГруппыВодаСток(
        Знач НаименованиеНоменклатурнойГруппы, Знач ПоУмолчанию = Неопределено, Знач НегативноеВоздействиеКакСток = Ложь) Экспорт

    ПоУмолчанию = ?(ПоУмолчанию = Неопределено, "<>", ПоУмолчанию);
    ЗначениеВода = "Вода";
    ЗначениеСток = "Сток";
    КэшСоответствий = Новый Соответствие;
    КэшСоответствий.Вставить("Водоснабжение", ЗначениеВода);
    КэшСоответствий.Вставить("Водоотведение", ЗначениеСток);
    КэшСоответствий.Вставить("Канализация", ЗначениеСток);

    НаименованиеНВ = ГП_РаботаСОтчетамиПовтИсп.ПолучитьНоменклатурнуюГруппуНегативногоВоздействия().Наименование;
    ПредставлениеНВ = ?(НегативноеВоздействиеКакСток = Истина, ЗначениеСток, "Негативное воздействие");
    КэшСоответствий.Вставить(НаименованиеНВ, ПредставлениеНВ);

    Для Каждого ЭлементКЗ Из КэшСоответствий Цикл
        Если СтрНачинаетсяС(НаименованиеНоменклатурнойГруппы, ЭлементКЗ.Ключ) Тогда
            Возврат ЭлементКЗ.Значение;
        КонецЕсли;
    КонецЦикла;

    Возврат ПоУмолчанию;
КонецФункции

// Параметры:
//  НоменклатурнаяГруппаСсылка - СправочникСсылка.НоменклатурныеГруппы
//  ПоУмолчанию - Строка, Неопределено
//  НегативноеВоздействиеКакСток - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьПредставлениеНоменклатурнойГруппыВодаСток(
        Знач НоменклатурнаяГруппаСсылка, Знач ПоУмолчанию = Неопределено, Знач НегативноеВоздействиеКакСток = Ложь) Экспорт

    НаименованиеНоменклатурнойГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатурнаяГруппаСсылка, "Наименование");

    Возврат ПолучитьПредставлениеНаименованияНоменклатурнойГруппыВодаСток(НаименованиеНоменклатурнойГруппы, ПоУмолчанию, НегативноеВоздействиеКакСток);
КонецФункции

// Параметры:
//  Должность - Строка
//  Организация - СправочникСсылка.Организации
//  ДатаАктуальности - Дата
// Возвращаемое значение:
//  - Строка
Функция ПолучитьФИОПредставителя(Знач Должность, Знач Организация, Знач ДатаАктуальности) Экспорт
    РезультатФункции = "";

    ОтветственныеЛицаОрганизации = ОтветственныеЛицаБППовтИсп.ОтветственныеЛица(Организация, ДатаАктуальности);

    ИмяПоляПредставления = Должность + "ФИО";
    Если ОтветственныеЛицаОрганизации.Свойство(ИмяПоляПредставления) Тогда
        РезультатФункции = ОтветственныеЛицаОрганизации[ИмяПоляПредставления].Представление;
    КонецЕсли;

    Если ПустаяСтрока(РезультатФункции) Тогда
        Если Должность = "ГлавныйБухгалтер" Тогда
            РезультатФункции = "Антипова О.А.";
        ИначеЕсли Должность = "Директор" Тогда
            РезультатФункции = "Машошин О.Л.";
        КонецЕсли;
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

Функция Абс(Знач Значение) Экспорт
    Возврат Макс(Значение, -Значение);
КонецФункции

#Область СКДРасчеты

// Гарант+ Килипенко 03.02.2025 [F00234067] Отчет Потребление по нормам ++
//
// Параметры:
//  ТаблицаДанных - ТаблицаЗначений
//      * ЛицевойСчет - СправочникСсылка.КВП_ЛицевыеСчета
//      * __КоличествоЖильцов__ - Число - Имя колонки определяется параметром `ИмяКолонкиКоличества`
//  ИмяКолонкиКоличества - Строка
// Возвращаемое значение:
//  - Число - Сумма количества жильцов
Функция РасчитатьСуммуЖильцовПоЛицевымСчетам(Знач ТаблицаДанных, Знач ИмяКолонкиКоличества) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = ГП_РаботаСОтчетамиПовтИсп.ПолучитьТекстЗапросаКоличестваЖильцовПоЛицевымСчетам(ИмяКолонкиКоличества);

    Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
    РезультатЗапроса = Запрос.Выполнить();

    РезультатФункции = 0;
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Выборка.Следующий() Тогда
    	РезультатФункции = Выборка.Сумма;
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции // Гарант+ Килипенко 03.02.2025 [F00234067] Отчет Потребление по нормам --

Функция ПолучитьОчищенноеПредставлениеНомераДокумента(Знач Номер) Экспорт
    Возврат СтрЗаменитьПоРегулярномуВыражению(Строка(Номер), "^(?:[^\-]+-)?[0]*(.+)$", "$1");
КонецФункции

// Параметры:
//  ТаблицаДанных - ТаблицаЗначений
//      * ЛицевойСчет - СправочникСсылка.КВП_ЛицевыеСчета
//      * Услуга - СправочникСсылка.КВП_Услуги
//      * __ИмяКолонкиНорматива__ - Число - Имя колонки определяется параметром `ИмяКолонкиНорматива`
//  ИмяКолонкиКоличества - Строка
// Возвращаемое значение:
//  - Число - Сумма норматива по л/с
Функция РасчитатьСуммуНормативаПоЛицевымСчетам(Знач ТаблицаДанных, Знач ИмяКолонкиНорматива) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = ГП_РаботаСОтчетамиПовтИсп.ПолучитьТекстЗапросаКоличестваЖильцовПоЛицевымСчетам(ИмяКолонкиНорматива);

    Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
    РезультатЗапроса = Запрос.Выполнить();

    РезультатФункции = 0;
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Выборка.Следующий() Тогда
    	РезультатФункции = Выборка.Сумма;
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

Функция ПолучитьУслугиПоНоменклатуре(Номенклатура)
	СписокУслуг = Новый("СписокЗначений");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КВП_Услуги.Ссылка КАК Ссылка,
	|	КВП_Услуги.Услуга КАК Услуга
	|ИЗ
	|	Справочник.КВП_Услуги КАК КВП_Услуги
	|ГДЕ
	|	КВП_Услуги.Услуга = &вхНоменклатура
	|	И НЕ КВП_Услуги.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("вхНоменклатура", Номенклатура); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокУслуг.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СписокУслуг;
КонецФункции // ()

Функция ПолучитьЗначениеТарифа(Знач ЗданиеПомещение, Знач Услуга, Знач НаДату) Экспорт
	сзУслуг = Новый("СписокЗначений");
	сзУслуг = ПолучитьУслугиПоНоменклатуре(Услуга);
	
	Если сзУслуг.Количество() = 0 Тогда
		РезультатФункции = 0;
		Возврат РезультатФункции;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	КВП_ТарифыСрезПоследних.Услуга КАК Услуга,
	               |	КВП_ТарифыСрезПоследних.Период КАК Период,
	               |	КВП_ТарифыСрезПоследних.Регистратор КАК Регистратор,
	               |	КВП_ТарифыСрезПоследних.НомерСтроки КАК НомерСтроки,
	               |	КВП_ТарифыСрезПоследних.Активность КАК Активность,
	               |	КВП_ТарифыСрезПоследних.Организация КАК Организация,
	               |	КВП_ТарифыСрезПоследних.ВидТарифа КАК ВидТарифа,
	               |	КВП_ТарифыСрезПоследних.Объект КАК Объект,
	               |	КВП_ТарифыСрезПоследних.Тариф КАК ЗначениеТарифа,
	               |	КВП_ТарифыСрезПоследних.Действует КАК Действует
	               |ИЗ
	               |	РегистрСведений.КВП_Тарифы.СрезПоследних(
	               |			КОНЕЦПЕРИОДА(&НаДату, МЕСЯЦ),
	               |			Объект = &вхОбъект
	               |				И Услуга В (&вхУслуга)
	               |				И ВидТарифа = ЗНАЧЕНИЕ(перечисление.КВП_ВидыТарифов.Общий)) КАК КВП_ТарифыСрезПоследних
	               |ГДЕ
	               |	КВП_ТарифыСрезПоследних.Действует
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Услуга,
	               |	Период";
	
	Запрос.УстановитьПараметр("вхОбъект", ЗданиеПомещение); 
	//Запрос.УстановитьПараметр("вхОрганизация", Организация); 
	
	Запрос.УстановитьПараметр("вхУслуга", сзУслуг); 
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатФункции = 0;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		РезультатФункции = Выборка.ЗначениеТарифа;
	КонецЦикла;
	
    Возврат РезультатФункции;
КонецФункции

Функция ПолучитьЗначениеТарифаПоТЧРегистратора(Знач ЗданиеПомещение,Знач ЛицевойСчет, Знач Услуга, Знач НаДату, Знач Регистратор) Экспорт
	РезультатФункции = 0;
	Если не ЗначениеЗаполнено(Регистратор)  Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
    ПараметрыЗаполненияТаблицы = Новый Структура;
    ПараметрыЗаполненияТаблицы.Вставить("НоменклатурнаяГруппа", Услуга);
    ПараметрыЗаполненияТаблицы.Вставить("ДатаНачала", НачалоМесяца(НаДату));
    ПараметрыЗаполненияТаблицы.Вставить("ДатаОкончания", КонецМесяца(НаДату));
    ПараметрыЗаполненияТаблицы.Вставить("ДатаАктуальности", ТекущаяДатаСеанса());
	ПараметрыЗаполненияТаблицы.Вставить("Регистратор", Регистратор);
	ПараметрыЗаполненияТаблицы.Вставить("Помещение", ЗданиеПомещение);
	ПараметрыЗаполненияТаблицы.Вставить("ЛицевойСчет", ЛицевойСчет);

    ДанныеЗаполнения =
        ПолучитьДанныеЗаполненияТаблицыСоответствий(ПараметрыЗаполненияТаблицы);

	Для Каждого СтрокаДанных Из ДанныеЗаполнения Цикл
		//Если СтрокаДанных.Контрагент = Регистратор.Контрагент 
		//	и Регистратор.Договор = СтрокаДанных.Договор Тогда
		//
		//	
		//
		//КонецЕсли;	
		нн = 0;
		Для каждого СтрокаТЧ Из Регистратор.Услуги Цикл
			Если СтрокаТЧ.Номенклатура = Услуга и СтрокаТЧ.Содержание = СтрокаДанных.НазначениеПлатежа Тогда
				РезультатФункции = СтрокаТЧ.Цена;
				Возврат РезультатФункции;
			КонецЕсли;
		КонецЦикла;
		//НоваяСтрокаСоответствий = ТаблицаСоответствий.Добавить();
		//НоваяСтрокаСоответствий.НазначениеПлатежа = СтрокаДанных.НазначениеПлатежа;
		//НоваяСтрокаСоответствий.Контрагент = СтрокаДанных.Контрагент;
		//НоваяСтрокаСоответствий.Договор = СтрокаДанных.Договор;
		//НоваяСтрокаСоответствий.ЛицевойСчет = СтрокаДанных.ЛицевойСчет;
    КонецЦикла;
	
	
    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ПараметрыЗаполнения - Структура
//      * ДатаНачала - Дата
//      * ДатаОкончания - Дата
//      * ДатаАктуальности - Дата
//      * НоменклатурнаяГруппа - СправочникСсылка.НоменклатурныеГруппы
// Возвращаемое значение:
//  - ТаблицаЗначений
//      * НазначениеПлатежа - Строка
//      * Контрагент - СправочникСсылка.Контрагенты
//      * Договор - СправочникСсылка.ДоговорыКонтрагентов
//      * ЛицевойСчет - СправочникСсылка.КВП_ЛицевыеСчета
//      * Номенклатура - СправочникСсылка.Номенклатура
Функция ПолучитьДанныеЗаполненияТаблицыСоответствий(Знач ПараметрыЗаполнения) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |	РеализацияУслуг.Содержание КАК НазначениеПлатежа,
        |	РеализацияУслуг.Ссылка.Контрагент КАК Контрагент,
        |	РеализацияУслуг.Ссылка.ДоговорКонтрагента КАК Договор,
        |	РеализацияУслуг.Номенклатура КАК Номенклатура
        |ПОМЕСТИТЬ ВТ_Реализация
        |ИЗ
        |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияУслуг
        |ГДЕ
        |	РеализацияУслуг.Ссылка.Проведен = ИСТИНА
        |	И РеализацияУслуг.Ссылка = &Ссылка
        |	И РеализацияУслуг.Номенклатура = &Номенклатура
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	СведенияДляВзаиморасчетовПоЛС.Период КАК Период,
        |	СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет КАК ЛицевойСчет,
        |	СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет.Адрес.Владелец КАК Здание,
        |	СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет.Адрес.Владелец.Наименование КАК Адрес,
        |	СведенияДляВзаиморасчетовПоЛС.Договор КАК Договор,
        |	СведенияДляВзаиморасчетовПоЛС.Контрагент КАК Контрагент
        |ИЗ
        |	РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС КАК СведенияДляВзаиморасчетовПоЛС
        |ГДЕ
        |	СведенияДляВзаиморасчетовПоЛС.Активность = ИСТИНА
        |	И СведенияДляВзаиморасчетовПоЛС.Контрагент В
        |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
        |				Т.Контрагент
        |			ИЗ
        |				ВТ_Реализация КАК Т)
        |	И СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет = &ЛицевойСчет
        |
        |УПОРЯДОЧИТЬ ПО
        |	СведенияДляВзаиморасчетовПоЛС.Период УБЫВ
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ВТ_Реализация.НазначениеПлатежа КАК НазначениеПлатежа,
        |	ВТ_Реализация.Контрагент КАК Контрагент,
        |	ВТ_Реализация.Договор КАК Договор,
        |	ВТ_Реализация.Номенклатура КАК Номенклатура
        |ИЗ
        |	ВТ_Реализация КАК ВТ_Реализация";

    ДатаАктуальности = ?(ПараметрыЗаполнения.Свойство("ДатаАктуальности"), ПараметрыЗаполнения.ДатаАктуальности, Неопределено);

    //Запрос.УстановитьПараметр("НоменклатурнаяГруппа", ПараметрыЗаполнения.НоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("Номенклатура", ПараметрыЗаполнения.НоменклатурнаяГруппа);
    //Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗаполнения.ДатаНачала);
    //Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗаполнения.ДатаОкончания);
	Запрос.УстановитьПараметр("Ссылка", ПараметрыЗаполнения.Регистратор);
	Запрос.УстановитьПараметр("ЛицевойСчет", ПараметрыЗаполнения.ЛицевойСчет);
	
    Если ДатаАктуальности <> Неопределено Тогда
        Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
    Иначе
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаАктуальности", "");
    КонецЕсли;

    РезультатПакетаЗапроса = Запрос.ВыполнитьПакет();
    ТаблицаПредварительныхДанных = РезультатПакетаЗапроса[2].Выгрузить();
    СведенияДляВзаиморасчетовПоЛС = РезультатПакетаЗапроса[1].Выгрузить();

    СведенияДляВзаиморасчетовПоЛС.Индексы.Добавить("Договор, Контрагент");
    ТаблицаПредварительныхДанных = СопоставитьДанные(
            ТаблицаПредварительныхДанных, СведенияДляВзаиморасчетовПоЛС, ПараметрыЗаполнения.НоменклатурнаяГруппа);

    РезультатФункции = ДополнитьДаннымиРанееВведенныхСоответствий(ТаблицаПредварительныхДанных, ДатаАктуальности);
    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ТаблицаДанных - ТаблицаЗначений
//      * НазначениеПлатежа - Строка
//      * Контрагент - СправочникСсылка.Контрагенты
//      * Договор - СправочникСсылка.ДоговорыКонтрагентов
//      * ЛицевойСчет - СправочникСсылка.КВП_ЛицевыеСчета
//      * Номенклатура - СправочникСсылка.Номенклатура
//  ДатаАктуальности - Дата, Неопределено
// Возвращаемое значение:
//  - ТаблицаЗначений
//      * НазначениеПлатежа - Строка
//      * Контрагент - СправочникСсылка.Контрагенты
//      * Договор - СправочникСсылка.ДоговорыКонтрагентов
//      * ЛицевойСчет - СправочникСсылка.КВП_ЛицевыеСчета
//      * Номенклатура - СправочникСсылка.Номенклатура
Функция ДополнитьДаннымиРанееВведенныхСоответствий(Знач ТаблицаДанных, Знач ДатаАктуальности = Неопределено)
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   *
        |ПОМЕСТИТЬ ВТ_ТаблицаДанных
        |ИЗ
        |   &ТаблицаДанных КАК ТаблицаДанных
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   *
        |ПОМЕСТИТЬ ВТ_СоответствияНазначенийПлатежей
        |ИЗ
        |   РегистрСведений.ГП_СоответствияНазначенийПлатежей.СрезПоследних(&ДатаАктуальности) КАК СоответствияНазначенийПлатежей
        |ГДЕ
        |   (Контрагент, Договор) В (ВЫБРАТЬ Т.Контрагент, Т.Договор ИЗ ВТ_ТаблицаДанных КАК Т)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   ВТ_ТаблицаДанных.НазначениеПлатежа КАК НазначениеПлатежа,
        |   ВТ_ТаблицаДанных.Контрагент КАК Контрагент,
        |   ВТ_ТаблицаДанных.Договор КАК Договор,
        |   ЕСТЬNULL(ВТ_СоответствияНазначенийПлатежей.ЛицевойСчет, ВТ_ТаблицаДанных.ЛицевойСчет) КАК ЛицевойСчет,
        |   ВТ_ТаблицаДанных.Номенклатура КАК Номенклатура
        |ИЗ
        |   ВТ_ТаблицаДанных КАК ВТ_ТаблицаДанных
        |   ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоответствияНазначенийПлатежей КАК ВТ_СоответствияНазначенийПлатежей
        |   ПО ВТ_ТаблицаДанных.Контрагент = ВТ_СоответствияНазначенийПлатежей.Контрагент
        |   И ВТ_ТаблицаДанных.ЛицевойСчет = ЗНАЧЕНИЕ(Справочник.КВП_ЛицевыеСчета.ПустаяСсылка)
        |   И ВТ_ТаблицаДанных.Договор = ВТ_СоответствияНазначенийПлатежей.Договор
        |   И ВТ_ТаблицаДанных.НазначениеПлатежа = ВТ_СоответствияНазначенийПлатежей.НазначениеПлатежа
        |";

    Если ДатаАктуальности = Неопределено Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаАктуальности", "");
    Иначе
        Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
    КонецЕсли;
    Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();
    Возврат РезультатФункции;
КонецФункции

Функция СопоставитьДанные(Знач ТаблицаПредварительныхДанных, Знач СведенияДляВзаиморасчетовПоЛС, Знач НоменклатурнаяГруппа)
    КлючиПоискаЛС = "Договор, Контрагент";

    РезультатФункции = ТаблицаПредварительныхДанных.Скопировать();
    РезультатФункции.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.КВП_ЛицевыеСчета"));

    СоответствиеПсевдонимовНоменклатурныхГрупп = ПолучитьСоответствиеПсевдонимовНоменклатурныхГрупп();

    КэшШаблоновЗаменыНаименованийНоменклатур = Новый Соответствие;
    Для Каждого СтрокаДанных Из РезультатФункции Цикл
        КлючКэшаНоменклатуры = ?(ЗначениеЗаполнено(СтрокаДанных.Номенклатура),
                СтрокаДанных.Номенклатура, НоменклатурнаяГруппа);
        ШаблонЗаменыНоменклатуры = КэшШаблоновЗаменыНаименованийНоменклатур.Получить(КлючКэшаНоменклатуры);
        Если ШаблонЗаменыНоменклатуры = Неопределено Тогда
            ШаблонЗаменыНоменклатуры = ПолучитьШаблонЗаменыСодержанияПоНоменклатуре(СоответствиеПсевдонимовНоменклатурныхГрупп,
                    СтрокаДанных.Номенклатура, НоменклатурнаяГруппа);
            КэшШаблоновЗаменыНаименованийНоменклатур.Вставить(КлючКэшаНоменклатуры,
                ?(ШаблонЗаменыНоменклатуры = Неопределено, "", ШаблонЗаменыНоменклатуры));
        КонецЕсли;

        Если ШаблонЗаменыНоменклатуры = Неопределено ИЛИ ПустаяСтрока(ШаблонЗаменыНоменклатуры) Тогда
            Продолжить;
        КонецЕсли;

        АдресПоиска = ПолучитьСтрокуАдресаИзСодержания(СтрокаДанных.НазначениеПлатежа, ШаблонЗаменыНоменклатуры);
        Если АдресПоиска = Неопределено Тогда
            Продолжить; // Не распознан адрес в строке содержания
        КонецЕсли;

        ЭтоЗданиеПотерьВоды = ГП_МиграцияОбщегоНазначения.ЭтоНаименованиеПотериВоды(АдресПоиска);
        ПоискСНеточнымСовпадением = ЭтоЗданиеПотерьВоды;

        СписокАдресовПоиска = ПодготовитНаименованиеЗданияДляСравнения(АдресПоиска);

        Для Каждого АдресПоиска Из СписокАдресовПоиска Цикл
            // Попытка найти соответствующий л/с
            НайденныйЛицевойСчет = ПопыткаНайтиЛицевойСчетИзДанныхВзаиморасчетов(
                    АдресПоиска,
                    Новый Структура(КлючиПоискаЛС, СтрокаДанных.Договор, СтрокаДанных.Контрагент),
                    СведенияДляВзаиморасчетовПоЛС, ПоискСНеточнымСовпадением);

            Если НайденныйЛицевойСчет = Неопределено Тогда
                // Попытка поиска по Контрагенту (без учета Договора)
                НайденныйЛицевойСчет = ПопыткаНайтиЛицевойСчетИзДанныхВзаиморасчетов(
                        АдресПоиска,
                        Новый Структура("Контрагент", СтрокаДанных.Контрагент),
                        СведенияДляВзаиморасчетовПоЛС,
                        СтрокаДанных.Договор, ПоискСНеточнымСовпадением);
            Иначе
                Прервать;
            КонецЕсли;
        КонецЦикла;

        СтрокаДанных.ЛицевойСчет = НайденныйЛицевойСчет;

    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

// Возвращаемое значение:
//  - Соответствие
Функция ПолучитьСоответствиеПсевдонимовНоменклатурныхГрупп() Экспорт
    РезультатФункции = Новый Соответствие;

    СтруктураНоменклатуры = ПолучитьНоменклатурнуюГруппуНегативноеВоздействиеНаЦСВ();
    СтруктураНоменклатуры.Вставить("Наименование",
        ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураНоменклатуры.Ссылка, "Наименование"));

    РезультатФункции.Вставить(СтруктураНоменклатуры, "Водоотведение");

    Возврат РезультатФункции;
КонецФункции
Функция ПолучитьНоменклатурнуюГруппуНегативноеВоздействиеНаЦСВ() Экспорт
    Возврат ПолучитьНоменклатурнуюГруппуПоКоду("0000158", Истина);
КонецФункции
// Параметры:
//  Код - Строка
//  ИгнорироватьПомеченныеНаУдаление - Булево
// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.НоменклатурныеГруппы
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьНоменклатурнуюГруппуПоКоду(Знач Код, Знач ИгнорироватьПомеченныеНаУдаление = Истина) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   НоменклатурныеГруппы.Ссылка КАК Ссылка,
        |   НоменклатурныеГруппы.Код КАК Код,
        |   НоменклатурныеГруппы.Наименование КАК Наименование
        |ИЗ
        |   Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
        |ГДЕ
        |   НоменклатурныеГруппы.Код = &Код
        |   И НоменклатурныеГруппы.ПометкаУдаления = ЛОЖЬ
        |";

    Запрос.УстановитьПараметр("Код", Код);
    Если ИгнорироватьПомеченныеНаУдаление = Ложь Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НоменклатурныеГруппы.ПометкаУдаления = ЛОЖЬ", "");
    КонецЕсли;

    РезультатЗапроса = Запрос.Выполнить();
    ТаблицаУслуг = РезультатЗапроса.Выгрузить();

    Если ТаблицаУслуг.Количество() <> 1 Тогда
        ВызватьИсключение(СтрШаблон("Ошибка при получении номенклатурной группы с кодом ""%1"". %2",
                Код,
                ?(ТаблицаУслуг.Количество() > 1, "Код номенклатурной группы не уникален.", "Номенклатурная группа отсутствует в ИБ.")));
    КонецЕсли;

    РезультатФункции = Новый Структура("Ссылка, Код, Наименование");
    ЗаполнитьЗначенияСвойств(РезультатФункции, ТаблицаУслуг[0]);

    Возврат РезультатФункции;
КонецФункции

Функция ПопыткаНайтиЛицевойСчетИзДанныхВзаиморасчетов(
        Знач АдресПоиска, Знач Отбор, Знач СведенияДляВзаиморасчетовПоЛС,
        Знач ИсключаяДоговор = Неопределено, Знач НеточноеСоответствие = Неопределено)

    НеточноеСоответствие = ?(НеточноеСоответствие = Неопределено, Ложь, НеточноеСоответствие);

    НайденныеСтроки = СведенияДляВзаиморасчетовПоЛС.НайтиСтроки(Отбор);
    НайденныйЛицевойСчет = Неопределено;
    Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
        Если НайденнаяСтрока.Договор = ИсключаяДоговор Тогда
            Продолжить;
        КонецЕсли;

        ОчищенныйНайденныйАдрес = ОчиститьАдрес(НайденнаяСтрока.Адрес);
        Если (НеточноеСоответствие = Ложь И ОчищенныйНайденныйАдрес = АдресПоиска)
            ИЛИ СтрНачинаетсяС(ОчищенныйНайденныйАдрес, АдресПоиска) Тогда
            НайденныйЛицевойСчет = НайденнаяСтрока.ЛицевойСчет;
            Возврат НайденныйЛицевойСчет;
        КонецЕсли;
    КонецЦикла;

    Возврат Неопределено;
КонецФункции

Функция ОчиститьАдрес(Знач Адрес)
    Адрес = НРег(Адрес);
    Возврат СтрЗаменитьПоРегулярномуВыражению(Адрес, "(?i)[^a-zа-я0-9]+", "");
КонецФункции

// Параметры:
//  НаименованиеЗдания - Строка
// Возвращаемое значение:
//  - Массив из Строка
Функция ПодготовитНаименованиеЗданияДляСравнения(Знач НаименованиеЗдания)
    РезультатФункции = Новый Массив;

    Если ГП_МиграцияОбщегоНазначения.ЭтоНаименованиеУслугиНегативногоВоздействия(НаименованиеЗдания) = Истина Тогда
        НаименованиеЗдания = ГП_МиграцияОбщегоНазначения.УдалитьСуффиксНегативногоВоздействия(НаименованиеЗдания);
        РезультатФункции.Добавить(НаименованиеЗдания);
    ИначеЕсли ГП_МиграцияОбщегоНазначения.ЭтоНаименованиеУслугиХолодногоВодоснабженияОИ(НаименованиеЗдания) = Истина Тогда
        РезультатФункции.Добавить(НаименованиеЗдания);
        НаименованиеЗдания = ГП_МиграцияОбщегоНазначения.УдалитьСуффиксХолодногоВодоснабженияОИ(НаименованиеЗдания);
        РезультатФункции.Добавить(НаименованиеЗдания);
    Иначе
        РезультатФункции.Добавить(НаименованиеЗдания);
    КонецЕсли;

    Для Сч = 0 По РезультатФункции.Количество() - 1 Цикл
        РезультатФункции[Сч] = ОчиститьАдрес(РезультатФункции[Сч]);
    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

Функция ПолучитьСтрокуАдресаИзСодержания(Знач Содержание, Знач ШаблонЗаменыНоменклатуры)
    // Удаление показаний счетчиков из строки содержания
    РезультатУдаленияПоказаний = ГП_ПриборыУчета_.УдалитьПоказанияСчетчиковИзСтроки(Содержание);
    Если РезультатУдаленияПоказаний.Успех = Истина Тогда
        Содержание = РезультатУдаленияПоказаний.Значение;
    КонецЕсли;

    // Удаление наименования номенклатуры из строки содержания
    Содержание = СтрЗаменитьПоРегулярномуВыражению(Содержание, ШаблонЗаменыНоменклатуры, "");

    //////////////////////////////////////////////////////////////////////
    // !!! УДАЛИТЬ! Не используется в новом механизме т.к. в содержание теперь записывается только наименование здания
    // Удаляем контрагента из строки содержания (вида: контрагент / здание)
    РезультатУдаленияКонтрагента = ГП_РаботаСЛицевымиСчетами.УдалитьКонтрагентаИзСтрокиНаименованияЛицевогоСчетаПоШаблону(Содержание);
    Если РезультатУдаленияКонтрагента.Успех = Истина Тогда
        Содержание = РезультатУдаленияКонтрагента.Значение;
    КонецЕсли;
    // !!! УДАЛИТЬ!  //////////////
    //////////////////////////////////////////////////////////////////////

    Возврат Содержание;
КонецФункции

Функция ПолучитьШаблонЗаменыСодержанияПоНоменклатуре(
        Знач СоответствиеНаименований, Знач НоменклатураСсылка, Знач НоменклатурнаяГруппаСсылка = Неопределено)

    РезультатФункции = Неопределено;

    Если ТипЗнч(НоменклатураСсылка) = Тип("СправочникСсылка.Номенклатура")
        И НоменклатураСсылка <> Справочники.Номенклатура.ПустаяСсылка() Тогда

        РезультатФункции = СоответствиеНаименований.Получить(НоменклатураСсылка);
        Если РезультатФункции = Неопределено Тогда
            РезультатФункции = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураСсылка, "Наименование"));
        КонецЕсли;
        РезультатФункции = СтрШаблон("^%1,\s", РезультатФункции);

        Возврат РезультатФункции;
    КонецЕсли;

    Если ТипЗнч(НоменклатурнаяГруппаСсылка) <> Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
        ВызватьИсключение("Не Несоответствие значений параметров");
    КонецЕсли;

    РезультатФункции = СоответствиеНаименований.Получить(НоменклатурнаяГруппаСсылка);
    Если РезультатФункции = Неопределено Тогда
        РезультатФункции = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатурнаяГруппаСсылка, "Наименование"));
    КонецЕсли;
    РезультатФункции = СтрШаблон("^%1\s", РезультатФункции);

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СКДРасчеты

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 05.11.2024 [F00230266] Отчет по шифрам --
