// Гарант+ Килипенко 05.11.2024 [F00230266] Отчет по шифрам ++
#Область ПрограммныйИнтерфейс

#Область ВспомогательныеФункцииКомпоновки

// Устарела.
//
// Параметры:
//  Отчет - ОтчетОбъект
//  Наименование - Строка
//  СтандартныйАлгоритм - Булево - Используется как временное решение для постепенного перехода на стандартный алгоритм
Функция ПолучитьПараметрПоНаименованию(Знач Отчет, Знач Наименование, Знач СтандартныйАлгоритм = Ложь) Экспорт
    РезультатФункции = Неопределено;

    Если СтандартныйАлгоритм = Истина Тогда
        РезультатФункции = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
                Отчет.КомпоновщикНастроек, Наименование);
    Иначе
        РезультатФункции = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
                Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, Наименование);
        Если РезультатФункции = Неопределено Тогда
            РезультатФункции = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
                    Отчет.КомпоновщикНастроек.Настройки, Наименование);
        КонецЕсли;
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

// Устарела.
//
// Параметры:
//  Отчет - ОтчетОбъект
//  Наименование - Строка
//  ЗначениеПоУмолчанию - Произвольный
//  ТолькоИспользуемый - Булево
// Возвращаемое значение:
//  Произвольный, Неопределено
Функция ПолучитьЗначениеПараметраПоНаименованию(
        Знач Отчет, Знач Наименование, Знач ЗначениеПоУмолчанию = Неопределено, Знач ТолькоИспользуемый = Истина) Экспорт

    НайденныйПараметр = ПолучитьПараметрПоНаименованию(Отчет, Наименование);
    Если НайденныйПараметр = Неопределено Тогда
        Возврат ЗначениеПоУмолчанию;
    КонецЕсли;

    Если ТолькоИспользуемый = Истина И НайденныйПараметр.Использование = Ложь Тогда
        Возврат ЗначениеПоУмолчанию;
    Иначе
        Возврат НайденныйПараметр.Значение;
    КонецЕсли;
КонецФункции

#КонецОбласти // ВспомогательныеФункцииКомпоновки

// Параметры:
//  НаименованиеНоменклатурнойГруппы - Строка
//  ПоУмолчанию - Строка, Неопределено
//  НегативноеВоздействиеКакСток - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьПредставлениеНаименованияНоменклатурнойГруппыВодаСток(
        Знач НаименованиеНоменклатурнойГруппы, Знач ПоУмолчанию = Неопределено, Знач НегативноеВоздействиеКакСток = Ложь) Экспорт

    ПоУмолчанию = ?(ПоУмолчанию = Неопределено, "<>", ПоУмолчанию);
    ЗначениеВода = "Вода";
    ЗначениеСток = "Сток";
    КэшСоответствий = Новый Соответствие;
    КэшСоответствий.Вставить("Водоснабжение", ЗначениеВода);
    КэшСоответствий.Вставить("Водоотведение", ЗначениеСток);
    КэшСоответствий.Вставить("Канализация", ЗначениеСток);

    НаименованиеНВ = ГП_РаботаСОтчетамиПовтИсп.ПолучитьНоменклатурнуюГруппуНегативногоВоздействия().Наименование;
    ПредставлениеНВ = ?(НегативноеВоздействиеКакСток = Истина, ЗначениеСток, "Негативное воздействие");
    КэшСоответствий.Вставить(НаименованиеНВ, ПредставлениеНВ);

    Для Каждого ЭлементКЗ Из КэшСоответствий Цикл
        Если СтрНачинаетсяС(НаименованиеНоменклатурнойГруппы, ЭлементКЗ.Ключ) Тогда
            Возврат ЭлементКЗ.Значение;
        КонецЕсли;
    КонецЦикла;

    Возврат ПоУмолчанию;
КонецФункции

// Параметры:
//  НоменклатурнаяГруппаСсылка - СправочникСсылка.НоменклатурныеГруппы
//  ПоУмолчанию - Строка, Неопределено
//  НегативноеВоздействиеКакСток - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьПредставлениеНоменклатурнойГруппыВодаСток(
        Знач НоменклатурнаяГруппаСсылка, Знач ПоУмолчанию = Неопределено, Знач НегативноеВоздействиеКакСток = Ложь) Экспорт

    НаименованиеНоменклатурнойГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатурнаяГруппаСсылка, "Наименование");

    Возврат ПолучитьПредставлениеНаименованияНоменклатурнойГруппыВодаСток(НаименованиеНоменклатурнойГруппы, ПоУмолчанию, НегативноеВоздействиеКакСток);
КонецФункции

// Параметры:
//  Должность - Строка
//  Организация - СправочникСсылка.Организации
//  ДатаАктуальности - Дата
// Возвращаемое значение:
//  - Строка
Функция ПолучитьФИОПредставителя(Знач Должность, Знач Организация, Знач ДатаАктуальности) Экспорт
    РезультатФункции = "";

    ОтветственныеЛицаОрганизации = ОтветственныеЛицаБППовтИсп.ОтветственныеЛица(Организация, ДатаАктуальности);

    ИмяПоляПредставления = Должность + "ФИО";
    Если ОтветственныеЛицаОрганизации.Свойство(ИмяПоляПредставления) Тогда
        РезультатФункции = ОтветственныеЛицаОрганизации[ИмяПоляПредставления].Представление;
    КонецЕсли;

    Если ПустаяСтрока(РезультатФункции) Тогда
        Если Должность = "ГлавныйБухгалтер" Тогда
            РезультатФункции = "Антипова О.А.";
        ИначеЕсли Должность = "Директор" Тогда
            РезультатФункции = "Машошин О.Л.";
        КонецЕсли;
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

Функция Абс(Знач Значение) Экспорт
    Возврат Макс(Значение, -Значение);
КонецФункции

#Область СКДРасчеты

// Устарела. Не используется в текущей реализации
//
// Гарант+ Килипенко 03.02.2025 [F00234067] Отчет Потребление по нормам ++
//
// Параметры:
//  ТаблицаДанных - ТаблицаЗначений
//      * ЛицевойСчет - СправочникСсылка.КВП_ЛицевыеСчета
//      * __КоличествоЖильцов__ - Число - Имя колонки определяется параметром `ИмяКолонкиКоличества`
//  ИмяКолонкиКоличества - Строка
// Возвращаемое значение:
//  - Число - Сумма количества жильцов
Функция РассчитатьСуммуЖильцовПоЛицевымСчетам(Знач ТаблицаДанных, Знач ИмяКолонкиКоличества) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = ГП_РаботаСОтчетамиПовтИсп.ПолучитьТекстЗапросаКоличестваЖильцовПоЛицевымСчетам(ИмяКолонкиКоличества);

    Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
    РезультатЗапроса = Запрос.Выполнить();

    РезультатФункции = 0;
    Выборка = РезультатЗапроса.Выбрать();

    Если Выборка.Следующий() Тогда
    	РезультатФункции = Выборка.Сумма;
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции // Гарант+ Килипенко 03.02.2025 [F00234067] Отчет Потребление по нормам --

Функция ПолучитьОчищенноеПредставлениеНомераДокумента(Знач Номер) Экспорт
    Возврат СтрЗаменитьПоРегулярномуВыражению(Строка(Номер), "^(?:[^\-]+-)?[0]*(.+)$", "$1");
КонецФункции

// Устарела. Не используется в текущей реализации
//
// Параметры:
//  ТаблицаДанных - ТаблицаЗначений
//      * ЛицевойСчет - СправочникСсылка.КВП_ЛицевыеСчета
//      * Услуга - СправочникСсылка.КВП_Услуги
//      * __ИмяКолонкиНорматива__ - Число - Имя колонки определяется параметром `ИмяКолонкиНорматива`
//  ИмяКолонкиКоличества - Строка
// Возвращаемое значение:
//  - Число - Сумма норматива по л/с
Функция РассчитатьСуммуНормативаПоЛицевымСчетам(Знач ТаблицаДанных, Знач ИмяКолонкиНорматива) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = ГП_РаботаСОтчетамиПовтИсп.ПолучитьТекстЗапросаКоличестваЖильцовПоЛицевымСчетам(ИмяКолонкиНорматива);

    Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
    РезультатЗапроса = Запрос.Выполнить();

    РезультатФункции = 0;
    Выборка = РезультатЗапроса.Выбрать();

    Если Выборка.Следующий() Тогда
    	РезультатФункции = Выборка.Сумма;
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

//! Гарант+ Килипенко 27.12.2025 [F00246884] Отчет по клиентам с тарифами +++
//
// Расчет среднего значения тарифа сводной таблицы
//
// Параметры:
//  Тарифы - Массив, Число
// Возвращаемое значение:
//  - Число, Неопределено
Функция СреднееРесурсаТариф(Знач Тарифы) Экспорт
    РезультатФункции = Неопределено;

    Если ТипЗнч(Тарифы) = Тип("Число") Тогда
        РезультатФункции = Тарифы;
    ИначеЕсли ТипЗнч(Тарифы) = Тип("Массив") И Тарифы.Количество() > 0 Тогда
        Если Тарифы.Количество() = 1 И Тарифы[0] <> NULL И Тарифы[0] <> Неопределено Тогда
            РезультатФункции = Тарифы[0];
        ИначеЕсли Тарифы.Количество() > 1 Тогда
            СредТариф = Неопределено;
            Для Каждого ТекТариф Из Тарифы Цикл
                Если ТекТариф = NULL ИЛИ ТекТариф = Неопределено Тогда
                    Продолжить;
                КонецЕсли;

                Если СредТариф = Неопределено Тогда
                    СредТариф = ТекТариф; // Инициализация
                    Продолжить;
                КонецЕсли;

                Если ТекТариф <> СредТариф Тогда
                    СредТариф = Неопределено; // Сброс результата
                    Прервать;
                КонецЕсли;
            КонецЦикла;

            Если СредТариф <> Неопределено Тогда
                РезультатФункции = СредТариф;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции //! Гарант+ Килипенко 27.12.2025 [F00246884] Отчет по клиентам с тарифами ---

#КонецОбласти // СКДРасчеты

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 05.11.2024 [F00230266] Отчет по шифрам --
