// Гарант+ Килипенко 24.01.2025 [F00233774] Добавление отборов дтн. показателей ++
#Область ПереопределениеСтандартногоФункционала

&Вместо("ПолучитьТекстЗапроса")
Функция ГП_ПолучитьТекстЗапроса(КоличествоИнтервалов)
    ИсходныйТекстЗапроса = ПродолжитьВызов(КоличествоИнтервалов);

    ТекстЗапросаФильтрПоДинПоказателям =
        "////////////////////////////////////////////////////////////////////////////////
        |// Гарант+ Килипенко 23.01.2024 Отборы по динамическим показателям л/с ++
        |// #ВСТАВКА
        |////////////////////////////////////////////////////////////////////////////////
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |    СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет КАК ЛицевойСчет,
        |    СведенияДляВзаиморасчетовПоЛС.Контрагент КАК Контрагент,
        |    ДинамическиеПоказателиЛицевыхСчетов.Водозабор КАК Водозабор,
        |    ДинамическиеПоказателиЛицевыхСчетов.Контролер КАК Контролер,
        |    ДинамическиеПоказателиЛицевыхСчетов.Финансирование КАК СпособФинансирования,
        |    ДинамическиеПоказателиЛицевыхСчетов.ВидПотребления КАК ГруппаПотребителей,
        |    ДинамическиеПоказателиЛицевыхСчетов.Характеристика КАК ХарактеристикаОбъекта
        |{ВЫБРАТЬ
        |	ЛицевойСчет.*,
        |	Контрагент.*,
        |	Водозабор.*,
        |	Контролер.*,
        |	СпособФинансирования.*,
        |	ГруппаПотребителей.*,
        |	ХарактеристикаОбъекта.*}
        |ПОМЕСТИТЬ ВТ_ДинамическиеПоказателиЛС
        |ИЗ
        |    РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС.СрезПоследних(&Период) КАК СведенияДляВзаиморасчетовПоЛС
        |    ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.lc_ДинамическиеПоказателиЛицевыхСчетов.СрезПоследних(&Период) КАК ДинамическиеПоказателиЛицевыхСчетов
        |    ПО СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет = ДинамическиеПоказателиЛицевыхСчетов.ЛицевойСчет
        |{ГДЕ
        |    ДинамическиеПоказателиЛицевыхСчетов.ЛицевойСчет.*,
        |    ДинамическиеПоказателиЛицевыхСчетов.Водозабор.*,
        |    ДинамическиеПоказателиЛицевыхСчетов.Контролер.*,
        |    ДинамическиеПоказателиЛицевыхСчетов.Финансирование.* КАК СпособФинансирования,
        |    ДинамическиеПоказателиЛицевыхСчетов.Характеристика.* КАК ХарактеристикаОбъекта,
        |    ДинамическиеПоказателиЛицевыхСчетов.ВидПотребления.* КАК ГруппаПотребителей
        |}
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |    Контрагенты.Ссылка КАК Контрагент
        |ПОМЕСТИТЬ ВТ_ФильтрДинамическихПоказателейКонтрагентов
        |ИЗ
        |    Справочник.Контрагенты КАК Контрагенты
        |    ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДинамическиеПоказателиЛС КАК ВТ_ДинамическиеПоказателиЛС
        |    ПО Контрагенты.Ссылка = ВТ_ДинамическиеПоказателиЛС.Контрагент
        |{ГДЕ
        |    ВТ_ДинамическиеПоказателиЛС.ЛицевойСчет.*,
        |    ВТ_ДинамическиеПоказателиЛС.Водозабор.*,
        |    ВТ_ДинамическиеПоказателиЛС.Контролер.*,
        |    ВТ_ДинамическиеПоказателиЛС.СпособФинансирования.*,
        |    ВТ_ДинамическиеПоказателиЛС.ХарактеристикаОбъекта.*,
        |    ВТ_ДинамическиеПоказателиЛС.ГруппаПотребителей.*
        |}
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |// Гарант+ Килипенко 23.01.2024 Отборы по динамическим показателям л/с --
        |// #КОНЕЦ_ВСТАВКИ
        |///////////////////////////////////////////////////////////////////////////////
        |";

    РезультатФункции = ТекстЗапросаФильтрПоДинПоказателям + Символы.ПС + ИсходныйТекстЗапроса;

    ТекстДополненияЗапроса =
        "////////////////////////////////////////////////////////////////////////////////
        |// Гарант+ Килипенко 23.01.2024 Отборы по динамическим показателям л/с ++
        |// #ВСТАВКА
        |////////////////////////////////////////////////////////////////////////////////
        |
        |ГДЕ
        |   ОстаткиПоПериодам.Контрагент В (ВЫБРАТЬ Т.Контрагент ИЗ ВТ_ФильтрДинамическихПоказателейКонтрагентов КАК Т)
        |
        |////////////////////////////////////////////////////////////////////////////////
        |// Гарант+ Килипенко 23.01.2024 Отборы по динамическим показателям л/с --
        |// #КОНЕЦ_ВСТАВКИ
        |///////////////////////////////////////////////////////////////////////////////
        |";

    ИсходнаяСтрокаВставки = "ОстаткиПоПериодам КАК ОстаткиПоПериодам";
    РезультатФункции = СтрЗаменить(РезультатФункции, ИсходнаяСтрокаВставки, ИсходнаяСтрокаВставки + Символы.ПС + ТекстДополненияЗапроса);

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПереопределениеСтандартногоФункционала
// Гарант+ Килипенко 24.01.2025 [F00233774] Добавление отборов дтн. показателей --
