
&ИзменениеИКонтроль("НастройкиОтчета")
Процедура ГП_НастройкиОтчета(Настройки)

    #Удаление // Гарант+ Килипенко 03.12.2024 [F00231911] Итоги в отчете Сверка сумм оплат в блоке ЖКХ и БП
    Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    #КонецУдаления
    #Вставка // Гарант+ Килипенко 03.12.2024 [F00231911] Итоги в отчете Сверка сумм оплат в блоке ЖКХ и БП ++
    
    Схема = ПолучитьМакет("ГП_ОсновнаяСхемаКомпоновкиДанных");
    
    #КонецВставки // Гарант+ Килипенко 03.12.2024 [F00231911] Итоги в отчете Сверка сумм оплат в блоке ЖКХ и БП --
    Для Каждого Вариант Из Схема.ВариантыНастроек Цикл
        Настройки.ОписаниеВариантов.Вставить(Вариант.Имя, Вариант.Представление);
    КонецЦикла;

КонецПроцедуры
