#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция-конструктор для хранения настроек отчета в универсальном формате.
//
Функция ПустыеПараметрыКомпоновкиОтчета() Экспорт

    // Общая структура настроек.
    ПараметрыОтчета = БухгалтерскиеОтчеты.ПустыеПараметрыКомпоновкиОтчета();

    ПараметрыОтчета.ИдентификаторОтчета = "ГП_РасчетАмортизацииКТарифам2025";
    БухгалтерскиеОтчеты.ДобавитьПоказателиВПараметры(ПараметрыОтчета, ПолучитьНаборПоказателей());

    ОтчетОбъект = Отчеты.ГП_РасчетАмортизацииКТарифам2025.Создать();
    ПараметрыОтчета.Вставить("Группировка", ОтчетОбъект.Группировка.ВыгрузитьКолонки());
    // 0 = В одной колонке, 1 = В отдельных колонках
    ПараметрыОтчета.Вставить("РазмещениеДополнительныхПолей",
        БухгалтерскиеОтчетыКлиентСервер.РазмещениеДополнительныхПолей().Отдельно);
    ПараметрыОтчета.Вставить("ДополнительныеПоля", ОтчетОбъект.ДополнительныеПоля.ВыгрузитьКолонки());

    Возврат ПараметрыОтчета;

КонецФункции

// Заполняет структуру настроек универсального формата из реквизитов формы.
//
// Параметры:
//  ПараметрыОтчета - Структура - см. ПустыеПараметрыКомпоновкиОтчета()
//  Форма - УправляемаяФорма - содержит основновной реквизит Отчет .
//
Процедура ЗаполнитьПараметрыИзФормы(ПараметрыОтчета, Форма) Экспорт

    БухгалтерскиеОтчеты.ЗаполнитьПараметрыИзФормы(ПараметрыОтчета, Форма);

КонецПроцедуры

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт

    Результат = Новый Структура;
    Результат.Вставить("ИспользоватьПередКомпоновкойМакета", Истина);
    Результат.Вставить("ИспользоватьПослеКомпоновкиМакета", Истина);
    Результат.Вставить("ИспользоватьПослеВыводаРезультата", Истина);
    Результат.Вставить("ИспользоватьДанныеРасшифровки", Ложь);

    Возврат Результат;

КонецФункции

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт

    Возврат НСтр("ru = 'Расчет амортизации к тарифам 2025'") + БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода);

КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт

    КомпоновщикНастроек.Настройки.Структура.Очистить();
    КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();

    Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) Тогда
        БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
        БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачПериодаОстатков", Новый Граница(НачалоДня(ПараметрыОтчета.НачалоПериода), ВидГраницы.Исключая));
    Иначе
        БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачПериодаОстатков", Дата(1, 1, 1, 0, 0, 1));
    КонецЕсли;
    Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
        БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонПериода", КонецДня(ПараметрыОтчета.КонецПериода));
        БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонПериодаОстатков", Новый Граница(КонецДня(ПараметрыОтчета.КонецПериода)));
    КонецЕсли;

    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 +++
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ГП_УстановитьОграничениеМинСтоимостьНачальныхОстатков", Истина);
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ГП_МинСтоимостьНачальныхОстатков", 100000);

    ГП_ТекущийГодОтчета = 2025;
    Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
        ГП_ТекущийГодОтчета = Год(ПараметрыОтчета.КонецПериода);
    Иначе
        ГП_ТекущийГодОтчета = Год(ТекущаяДатаСеанса());
    КонецЕсли;
    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 ---

    Структура = КомпоновщикНастроек.Настройки;

    Для Каждого ПолеВыбраннойГруппировки Из ПараметрыОтчета.Группировка Цикл
        Если ПолеВыбраннойГруппировки.Использование Тогда
            Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
            ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
            ПолеГруппировки.Использование = Истина;
            ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ПолеВыбраннойГруппировки.Поле);
            Если ПолеВыбраннойГруппировки.ТипГруппировки = 1 Тогда
                ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
            ИначеЕсли ПолеВыбраннойГруппировки.ТипГруппировки = 2 Тогда
                ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
            Иначе
                ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
            КонецЕсли;
            Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
            Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
        КонецЕсли;
    КонецЦикла;

    КоличествоПоказателей = БухгалтерскиеОтчетыВызовСервера.КоличествоПоказателей(ПараметрыОтчета);

    Если КоличествоПоказателей > 1 Тогда
        ГруппаПоказатели = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
        ГруппаПоказатели.Заголовок = НСтр("ru = 'Показатели'");
        ГруппаПоказатели.Использование = Истина;
        ГруппаПоказатели.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

        Для Каждого ИмяПоказателя Из ПараметрыОтчета.НаборПоказателей Цикл
            Если ПараметрыОтчета["Показатель" + ИмяПоказателя] Тогда
                БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПоказатели, "Показатель" + ИмяПоказателя);
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;

    ГруппаДанныеНаНачало = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаДанныеНаНачало.Заголовок = НСтр("ru = 'На начало периода'");
    ГруппаДанныеНаНачало.Использование = Истина;
    ГруппаДанныеНаНачалоСтоимость = ГруппаДанныеНаНачало.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаДанныеНаНачалоСтоимость.Заголовок = НСтр("ru = 'Первоначальная стоимость'"); // гр 6
    ГруппаДанныеНаНачалоСтоимость.Использование = Истина;
    ГруппаДанныеНаНачалоСтоимость.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
    ГруппаДанныеНаНачалоАмортизация = ГруппаДанныеНаНачало.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаДанныеНаНачалоАмортизация.Заголовок = НСтр("ru = 'Амортизация нарастающим итогом'"); // гр 7
    ГруппаДанныеНаНачалоАмортизация.Использование = Истина;
    ГруппаДанныеНаНачалоАмортизация.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
    ГруппаДанныеНаНачалоОстаточнаяСтоимость = ГруппаДанныеНаНачало.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаДанныеНаНачалоОстаточнаяСтоимость.Заголовок = НСтр("ru = 'Остаточная стоимость'"); // гр 8
    ГруппаДанныеНаНачалоОстаточнаяСтоимость.Использование = Истина;
    ГруппаДанныеНаНачалоОстаточнаяСтоимость.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    ГруппаОбороты = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаОбороты.Заголовок = ПредставлениеПериода(НачалоДня(ПараметрыОтчета.НачалоПериода), КонецДня(ПараметрыОтчета.КонецПериода), "L=ru_RU");
    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 +++
    ГруппаОбороты.Расположение = РасположениеПоляКомпоновкиДанных.Горизонтально;
    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 ---

    ГруппаОбороты.Использование = Истина;
    ГруппаНачислениеАмортизации = ГруппаОбороты.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаНачислениеАмортизации.Заголовок = НСтр("ru = 'Начисление амортизации (факт)'"); // гр 9
    ГруппаНачислениеАмортизации.Использование = Истина;
    ГруппаНачислениеАмортизации.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 +++

    // ГР. Н.8 (Поступление ОС):
    ГП_ГруппаСтоимостьУвеличение = ГруппаОбороты.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГП_ГруппаСтоимостьУвеличение.Заголовок = "Поступление ОС";
    ГП_ГруппаСтоимостьУвеличение.Использование = Истина;
    ГП_ГруппаСтоимостьУвеличение.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    // ГР. Н.10 (Выбытие ОС):
    ГП_ГруппаСтоимостьУменьшение = ГруппаОбороты.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГП_ГруппаСтоимостьУменьшение.Заголовок = "Выбытие ОС";
    ГП_ГруппаСтоимостьУменьшение.Использование = Истина;
    ГП_ГруппаСтоимостьУменьшение.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    // Устарела:
    //ГруппаРасчетнаяАмортизацияПоМаксСПИ = ГруппаОбороты.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    //ГруппаРасчетнаяАмортизацияПоМаксСПИ.Заголовок = НСтр("ru = 'Расчетная амортизация по макс. СПИ ((Гр.6 | Гр.11)/Гр.5*МА)'"); // гр 10 - УСТАРЕЛА
    //ГруппаРасчетнаяАмортизацияПоМаксСПИ.Использование = Истина;
    //ГруппаРасчетнаяАмортизацияПоМаксСПИ.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 ---

    ГруппаДанныеНаКонец = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаДанныеНаКонец.Заголовок = НСтр("ru = 'На конец периода'");
    ГруппаДанныеНаКонец.Использование = Истина;
    ГруппаДанныеНаКонецСтоимость = ГруппаДанныеНаКонец.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаДанныеНаКонецСтоимость.Заголовок = НСтр("ru = 'Первоначальная стоимость'"); // гр 11
    ГруппаДанныеНаКонецСтоимость.Использование = Истина;
    ГруппаДанныеНаКонецСтоимость.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
    ГруппаДанныеНаКонецАмортизация = ГруппаДанныеНаКонец.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаДанныеНаКонецАмортизация.Заголовок = НСтр("ru = 'Амортизация нарастающим итогом'"); // гр 12
    ГруппаДанныеНаКонецАмортизация.Использование = Истина;
    ГруппаДанныеНаКонецАмортизация.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
    ГруппаДанныеНаКонецОстаточнаяСтоимость = ГруппаДанныеНаКонец.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаДанныеНаКонецОстаточнаяСтоимость.Заголовок = НСтр("ru = 'Остаточная стоимость'"); // гр 13
    ГруппаДанныеНаКонецОстаточнаяСтоимость.Использование = Истина;
    ГруппаДанныеНаКонецОстаточнаяСтоимость.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    ГруппаДанныеПланируемаяСтоиимость = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаДанныеПланируемаяСтоиимость.Заголовок = НСтр("ru = 'Планируемая стоиимость'");
    ГруппаДанныеПланируемаяСтоиимость.Использование = Истина;

    ГруппаПланируемаяОстаточнаяСтоимостьНа31122022 = ГруппаДанныеПланируемаяСтоиимость.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 +++
    //
    //ГруппаПланируемаяОстаточнаяСтоимостьНа31122022.Заголовок = НСтр("ru = 'Планируемая остаточная стоимость на 31.12.2022 (гр.13 - гр.9/МА*12)'"); // гр 14

    ГруппаПланируемаяОстаточнаяСтоимостьНа31122022.Заголовок = СтрШаблон("Планируемая остаточная стоимость на 31.12.%1 (гр.13 - гр.9/МА*12)",
        XMLСтрока(ГП_ТекущийГодОтчета + 1)); // гр ?
    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 ---
    ГруппаПланируемаяОстаточнаяСтоимостьНа31122022.Использование = Истина;
    ГруппаПланируемаяОстаточнаяСтоимостьНа31122022.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    ГруппаПланируемаяОстаточнаяСтоимостьНа31122023 = ГруппаДанныеПланируемаяСтоиимость.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 +++
    //
    //ГруппаПланируемаяОстаточнаяСтоимостьНа31122023.Заголовок = НСтр("ru = 'Планируемая остаточная стоимость на 31.12.2023 (гр.13 - 2*гр.9/МА*12)'"); // гр 15

    ГруппаПланируемаяОстаточнаяСтоимостьНа31122023.Заголовок = СтрШаблон("Планируемая остаточная стоимость на 31.12.%1 (гр.13 - 2*гр.9/МА*12)",
        XMLСтрока(ГП_ТекущийГодОтчета + 2)); // гр ?
    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 ---
    ГруппаПланируемаяОстаточнаяСтоимостьНа31122023.Использование = Истина;
    ГруппаПланируемаяОстаточнаяСтоимостьНа31122023.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 +++
    //  ~~~ Исключено

    //ГруппаСравнениеОстатСтоимостиНа31122023сРасчетнойАмортЗа2года = ГруппаДанныеПланируемаяСтоиимость.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    //ГруппаСравнениеОстатСтоимостиНа31122023сРасчетнойАмортЗа2года.Заголовок = НСтр(
    //        "ru = 'Сравнение остат. стоимости на 31.12.2022 с расчетной или фактич. аморт. гр.4 <= гр.5, то (гр.14 - гр.10), гр.4 > гр.5, то (гр.14 - гр.9)'"); // гр 16
    //ГруппаСравнениеОстатСтоимостиНа31122023сРасчетнойАмортЗа2года.Заголовок = НСтр(
    //        "ru = 'Сравнение остат. стоимости на 31.12.2022 с расчетной или фактич. аморт. гр.4 <= гр.5, то (гр.14 - гр.10), гр.4 > гр.5, то (гр.14 - гр.9)'"); // гр 16
    //ГруппаСравнениеОстатСтоимостиНа31122023сРасчетнойАмортЗа2года.Использование = Истина;
    //ГруппаСравнениеОстатСтоимостиНа31122023сРасчетнойАмортЗа2года.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    //ГруппаИтоговаяРасчетнаяАморизацияПоМаксСПИсУчетомОстСтоимости = ГруппаДанныеПланируемаяСтоиимость.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    //ГруппаИтоговаяРасчетнаяАморизацияПоМаксСПИсУчетомОстСтоимости.Заголовок = НСтр(
    //        "ru = 'Итоговая расчетная аморизация по макс. СПИ с учетом ост. стоимости (если гр.16 -, то взять результат гр.14, если гр.16 +, то при гр.4 ≤ гр.5 взять результат гр.10 при гр.4 > гр.5  взять результат гр.9)'"); // гр 17
    //ГруппаИтоговаяРасчетнаяАморизацияПоМаксСПИсУчетомОстСтоимости.Использование = Истина;
    //ГруппаИтоговаяРасчетнаяАморизацияПоМаксСПИсУчетомОстСтоимости.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    // ГР. Н.16 (Итоговая расчетная амортизация):
    ГП_ГруппаПланируемаяИтоговаяРасчетнаяАмортизация = ГруппаДанныеПланируемаяСтоиимость.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГП_ГруппаПланируемаяИтоговаяРасчетнаяАмортизация.Заголовок = СтрШаблон(
        "Итоговая расчетная амортизация на %2 год по факт. СПИ с учетом ост. стоимости (гр.11/гр.4*12) сравнить результат с гр.15."
        + " Если гр.15 меньше вычисления гр 16, то гр.16= значение гр 15. Если больше, то результат вычисления остается в гр.16.", XMLСтрока(ГП_ТекущийГодОтчета + 2));
    ГП_ГруппаПланируемаяИтоговаяРасчетнаяАмортизация.Использование = Истина;
    ГП_ГруппаПланируемаяИтоговаяРасчетнаяАмортизация.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 ---

    ГруппаЧмслоМесяцевАмортизации = ГруппаДанныеПланируемаяСтоиимость.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаЧмслоМесяцевАмортизации.Заголовок = НСтр("ru = 'Число месяцев амортизации'"); // гр 18
    ГруппаЧмслоМесяцевАмортизации.Использование = Истина;
    ГруппаЧмслоМесяцевАмортизации.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    ГруппаОстаточнаяСтоимость = ГруппаДанныеПланируемаяСтоиимость.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГруппаОстаточнаяСтоимость.Заголовок = НСтр("ru = 'Остаточная Стоимость'"); // гр 19
    ГруппаОстаточнаяСтоимость.Использование = Истина;
    ГруппаОстаточнаяСтоимость.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

    Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
    Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
    Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));

    Для Каждого ИмяПоказателя Из ПараметрыОтчета.НаборПоказателей Цикл
        Если ПараметрыОтчета["Показатель" + ИмяПоказателя] Тогда
            Если ИмяПоказателя = "БУ" Тогда
                СуффиксПоказателя = "";
                СуффиксАмортизация = "Износ";
            Иначе
                СуффиксПоказателя = ИмяПоказателя;
                СуффиксАмортизация = ИмяПоказателя;
            КонецЕсли;

            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаДанныеНаНачалоСтоимость, "НаНачалоПериода.Стоимость" + СуффиксПоказателя + "ОстатокНачПериода"); //6 (ГР. Н.5)
            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаДанныеНаНачалоАмортизация, "НаНачалоПериода.Амортизация" + СуффиксАмортизация + "ОстатокНачПериода"); //7 (ГР. Н.6)

            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаДанныеНаНачалоОстаточнаяСтоимость, "НаНачалоПериода.ОстаточнаяСтоимость" + СуффиксПоказателя + "НачПериода"); //8 (ГР. Н.7)

            //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 +++
            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГП_ГруппаСтоимостьУвеличение, "ЗаПериод.Стоимость" + СуффиксПоказателя + "Увеличение"); // ГР. Н.8
            //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 ---

            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаНачислениеАмортизации, "ЗаПериод.Амортизация" + СуффиксАмортизация + "Начисление"); // 9 (ГР. Н.9)

            //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 +++
            //
            //БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаРасчетнаяАмортизацияПоМаксСПИ, "ЗаПериод.РасчетнаяАмортизацияПоМаксСПИ"); // 10 - УСТАРЕЛА, не используется

            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГП_ГруппаСтоимостьУменьшение, "ЗаПериод.Стоимость" + СуффиксПоказателя + "Уменьшение"); // ГР. Н.10
            //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 ---

            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаДанныеНаКонецСтоимость, "НаКонецПериода.Стоимость" + СуффиксПоказателя + "ОстатокКонПериода"); // 11
            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаДанныеНаКонецАмортизация, "НаКонецПериода.Амортизация" + СуффиксАмортизация + "ОстатокКонПериода"); // 12
            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаДанныеНаКонецОстаточнаяСтоимость, "НаКонецПериода.ОстаточнаяСтоимость" + СуффиксПоказателя + "КонПериода"); // 13

            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПланируемаяОстаточнаяСтоимостьНа31122022, "ПланируемаяСтоиимость.ПланируемаяОстаточнаяСтоимостьНа31122022"); // 14
            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПланируемаяОстаточнаяСтоимостьНа31122023, "ПланируемаяСтоиимость.ПланируемаяОстаточнаяСтоимостьНа31122023"); // 15
            //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 +++
            //БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(
            //    ГруппаСравнениеОстатСтоимостиНа31122023сРасчетнойАмортЗа2года, "ПланируемаяСтоиимость.СравнениеОстатСтоимостиНа31122023сРасчетнойАмортЗа2года"); // 16 - Гарант+ УСТАРЕЛА

            //БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(
            //    ГруппаИтоговаяРасчетнаяАморизацияПоМаксСПИсУчетомОстСтоимости, "ПланируемаяСтоиимость.ИтоговаяРасчетнаяАморизацияПоМаксСПИсУчетомОстСтоимости"); // 17

            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(
                ГП_ГруппаПланируемаяИтоговаяРасчетнаяАмортизация, "ПланируемаяСтоиимость.ГП_ПланируемаяИтоговаяРасчетнаяАмортизация"); // ГР. Н.16

            //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 ---

            БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(
                ГруппаЧмслоМесяцевАмортизации, "ПланируемаяСтоиимость.ЧислоМесяцевАмортизации"); // 18                                                                // 19

        КонецЕсли;
    КонецЦикла;

    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 +++
    //
    //БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек.Настройки, "СистемныеПоля.НомерПоПорядку");
    //БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек.Настройки, "ОсновноеСредство");
    //БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек.Настройки, "ОсновноеСредство.ИнвентарныйНомер");
    //БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек.Настройки, "СрокПолезногоИспользования");
    //БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек.Настройки, "МаксимальныйСрокПолезногоИспользования");

    ГП_ГруппаДанныеОбщие = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
    ГП_ГруппаДанныеОбщие.Заголовок = "";
    ГП_ГруппаДанныеОбщие.Использование = Истина;
    ГП_ГруппаДанныеОбщие.Расположение = РасположениеПоляКомпоновкиДанных.Горизонтально;

    БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГП_ГруппаДанныеОбщие, "СистемныеПоля.НомерПоПорядку");
    БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГП_ГруппаДанныеОбщие, "ОсновноеСредство");
    БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГП_ГруппаДанныеОбщие, "ОсновноеСредство.ИнвентарныйНомер");
    БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГП_ГруппаДанныеОбщие, "СрокПолезногоИспользования");
    //БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГП_ГруппаДанныеОбщие, "МаксимальныйСрокПолезногоИспользования");

    //ГП_ОтборПоНачальнойСтоимостиОС = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    //ГП_ОтборПоНачальнойСтоимостиОС.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НаНачалоПериода.СтоимостьОстатокНачПериода");
    //ГП_ОтборПоНачальнойСтоимостиОС.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    //ГП_ОтборПоНачальнойСтоимостиОС.ПравоеЗначение = 100000;
    //ГП_ОтборПоНачальнойСтоимостиОС.Использование = Истина;
    //ГП_ОтборПоНачальнойСтоимостиОС.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;

    //ГП_ОтборПоНачальнойСтоимостиОС = БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
    //    КомпоновщикНастроек.Настройки,
    //    "НаНачалоПериода.СтоимостьОстатокНачПериода",
    //    100000,
    //    ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
    //    Истина,
    //    Истина);
    //ГП_ОтборПоНачальнойСтоимостиОС.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;

    //! Гарант+ Килипенко 29.05.2026 [F00251298] Отчет Расчет амортизации к тарифам 2025 ---

    // Дополнительные данные
    БухгалтерскиеОтчетыВызовСервера.ДобавитьДополнительныеПоля(ПараметрыОтчета, КомпоновщикНастроек);

    БухгалтерскиеОтчетыВызовСервера.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);

КонецПроцедуры

Процедура ПослеКомпоновкиМакета(ПараметрыОтчета, МакетКомпоновки) Экспорт

    МакетШапкиОтчета = БухгалтерскиеОтчеты.ПолучитьМакетШапки(МакетКомпоновки);

    КоличествоПоказателей = БухгалтерскиеОтчетыВызовСервера.КоличествоПоказателей(ПараметрыОтчета);

    КоличествоГруппировок = 1;
    Для Каждого СтрокаГруппировки Из ПараметрыОтчета.Группировка Цикл
        Если СтрокаГруппировки.Использование Тогда
            КоличествоГруппировок = КоличествоГруппировок + 1;
        КонецЕсли;
    КонецЦикла;

    КоличествоСтрокШапки = Макс(КоличествоГруппировок, 2);
    ПараметрыОтчета.Вставить("ВысотаШапки", КоличествоСтрокШапки);

    КоличествоСтрок = МакетШапкиОтчета.Макет.Количество();
    Для ИндексСтроки = 2 По КоличествоСтрок - 1 Цикл
        СтрокаМакета = МакетШапкиОтчета.Макет[ИндексСтроки];

        КоличествоКолонок = СтрокаМакета.Ячейки.Количество();

        Для ИндексКолонки = КоличествоКолонок - 10 По КоличествоКолонок - 1 Цикл
            Ячейка = СтрокаМакета.Ячейки[ИндексКолонки];
            БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Ячейка.Оформление.Элементы, "ОбъединятьПоВертикали", Истина);
        КонецЦикла;
    КонецЦикла;

    Если КоличествоПоказателей > 1 Тогда
        Для ИндексСтроки = 1 По КоличествоСтрок - 1 Цикл
            СтрокаМакета = МакетШапкиОтчета.Макет[ИндексСтроки];

            КоличествоКолонок = СтрокаМакета.Ячейки.Количество();
            Ячейка = СтрокаМакета.Ячейки[КоличествоКолонок - 11];
            БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Ячейка.Оформление.Элементы, "ОбъединятьПоВертикали", Истина);
        КонецЦикла;
    КонецЕсли;

    // Снимем флаг Игнорировать значение Null для реквизитов основного средства
    Для Каждого Поле Из МакетКомпоновки.НаборыДанных.НаборДанных1.Поля Цикл
        Если Лев(Поле.ПутьКДанным, 17) = "ОсновноеСредство." Тогда
            Поле.Роль.ИгнорироватьЗначенияNULL = Ложь;
        КонецЕсли;
    КонецЦикла;

    МассивДляУдаления = Новый Массив;
    Для Индекс = КоличествоСтрокШапки По МакетШапкиОтчета.Макет.Количество() - 1 Цикл
        МассивДляУдаления.Добавить(МакетШапкиОтчета.Макет[Индекс]);
    КонецЦикла;

    Для Каждого Элемент Из МассивДляУдаления Цикл
        МакетШапкиОтчета.Макет.Удалить(Элемент);
    КонецЦикла;

КонецПроцедуры

Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт

    БухгалтерскиеОтчетыВызовСервера.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);

    Если Результат.Области.Найти("Заголовок") = Неопределено Тогда
        Результат.ФиксацияСверху = ПараметрыОтчета.ВысотаШапки;
    Иначе
        Результат.ФиксацияСверху = Результат.Области.Заголовок.Низ + ПараметрыОтчета.ВысотаШапки;
    КонецЕсли;

КонецПроцедуры

Функция ПолучитьНаборПоказателей() Экспорт

    НаборПоказателей = Новый Массив;
    НаборПоказателей.Добавить("БУ");
    НаборПоказателей.Добавить("НУ");
    НаборПоказателей.Добавить("ПР");
    НаборПоказателей.Добавить("ВР");
    НаборПоказателей.Добавить("Контроль");

    Возврат НаборПоказателей;

КонецФункции

#КонецОбласти

#КонецЕсли
