
&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
    //ПараметрВодозабор = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("Водозабор"));
    //ПараметрОтбора = Настройки.Элементы[2];
    //ПараметрОтбора.Значение = Справочники.lc_Водозаборы.ПустаяСсылка();
    //
    //ПараметрОтбора = Настройки.Элементы[3];
    //ПараметрОтбора.Значение = Справочники.lc_Контролеры.ПустаяСсылка();
    //
    //ПараметрОтбора = Настройки.Элементы[5];
    //ПараметрОтбора.Значение = Справочники.lc_СпособыФинансирования.ПустаяСсылка();
    
    // !!! Временное решение из-за отстутствия типов в расширении
    Попытка
        Для каждого ПараметрОтбора Из Настройки.Элементы Цикл
            Если ПараметрОтбора.Параметр = Новый ПараметрКомпоновкиДанных("Водозабор") Тогда
                ПараметрОтбора.Значение = Справочники.lc_Контролеры.ПустаяСсылка();
            ИначеЕсли ПараметрОтбора.Параметр = Новый ПараметрКомпоновкиДанных("Контролер") Тогда
                ПараметрОтбора.Значение = Справочники.lc_Контролеры.ПустаяСсылка();
            ИначеЕсли ПараметрОтбора.Параметр = Новый ПараметрКомпоновкиДанных("Финансирование") Тогда
                ПараметрОтбора.Значение = Справочники.lc_СпособыФинансирования.ПустаяСсылка();
            КонецЕсли;
        КонецЦикла;
    Исключение
        // Без сообщения
    КонецПопытки;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    //СКД = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    //СКД.Параметры.Водозабор.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.lc_Водозаборы");
    //СКД.Параметры.Водозабор.Значение = Справочники.lc_Водозаборы.ПустаяСсылка();
КонецПроцедуры

