// Гарант+ Килипенко 09.10.2024 [F00228925] Отчет по клиентам ++
&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
    // !!! Временное решение из-за отсутствия типов в расширении
    Попытка
        Для каждого ПараметрОтбора Из Настройки.Элементы Цикл
            Если ПараметрОтбора.Параметр = Новый ПараметрКомпоновкиДанных("Водозабор") Тогда
                ПараметрОтбора.Значение = Справочники.lc_Водозаборы.ПустаяСсылка();
            ИначеЕсли ПараметрОтбора.Параметр = Новый ПараметрКомпоновкиДанных("Контролер") Тогда
                ПараметрОтбора.Значение = Справочники.lc_Контролеры.ПустаяСсылка();
            ИначеЕсли ПараметрОтбора.Параметр = Новый ПараметрКомпоновкиДанных("Финансирование") Тогда
                ПараметрОтбора.Значение = Справочники.lc_СпособыФинансирования.ПустаяСсылка();
            КонецЕсли;
        КонецЦикла;
    Исключение
        // Без сообщения
    КонецПопытки;
КонецПроцедуры
// Гарант+ Килипенко 09.10.2024 [F00228925] Отчет по клиентам --
