// Гарант+ Килипенко 31.01.2025 [F00234022] Отчет Взаимозадолженность (для Вялых) ++
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;

    ИнициализироватьПараметры();

    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных,
            ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);

    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    МВТ = Новый МенеджерВременныхТаблиц;

    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина, Истина, МВТ);

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
// Гарант+ Килипенко 31.01.2025 [F00234022] Отчет Взаимозадолженность (для Вялых) --

// Гарант+ Килипенко 31.01.2025 [F00234022] Отчет Взаимозадолженность (для Вялых) ++
#Область СлужебныеПроцедурыИФункции

// Устарела. Не используется
Функция Удалить_ПолучитьСчетаУчетаВзаиморасчетов()
    РезультатФункции = Новый СписокЗначений;

    ТаблицаСчетов = УчетВзаиморасчетов.ПолучитьТаблицуСчетовУчетаВзаиморасчетов(Истина, Ложь);

    Для Каждого СтрокаСчета Из ТаблицаСчетов Цикл
        РезультатФункции.Добавить(СтрокаСчета.СчетРасчетов);
    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

Функция ПолучитьОсновнойНаборДанных()
    Возврат ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1;
КонецФункции

Процедура ИнициализироватьПараметры()
    // Установка границ периода отчета
    УточнитьПараметрыПериодаОтчета();

    // Заполняем параметр АналитикаРасчетов
    АналитикаРасчетов = Новый СписокЗначений;
    АналитикаРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
    АналитикаРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "АналитикаРасчетов", АналитикаРасчетов);

    // Заполняем параметр СтавкаНДС:
    //
    //! Гарант+ Килипенко 04.01.2026 [F00246890] НДС 22/122 +++
    //
    //БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
    //    ЭтотОбъект.КомпоновщикНастроек, "СтавкаНДС", Перечисления.СтавкиНДС.НДС20);

    ПараметрСтавкаНДС = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
            ЭтотОбъект.КомпоновщикНастроек, "СтавкаНДС");

    // Формирование представления заголовка колонки  Сумма НДС
    НайденныеЭлементы = ГП_РаботаСОтчетами.НайтиЭлементыУсловногоОформленияТекста(
        "СуммаНДС20", ЭтотОбъект.КомпоновщикНастроек.Настройки, "%%СтавкаНДСПредставление%%");
    СтавкаНДСЧислом = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ПараметрСтавкаНДС.Значение);
    Для Каждого ТекущийЭлемент Из НайденныеЭлементы Цикл
        ТекущийЭлемент.Значение = "Сумма НДС " + Строка(ПараметрСтавкаНДС.Значение);
    КонецЦикла;

    //! Гарант+ Килипенко 04.01.2026 [F00246890] НДС 22/122 ---
КонецПроцедуры

Функция УточнитьПараметрыПериодаОтчета()
    РезультатФункции = Новый Структура("Период", Дата(1, 1, 1));

    ПараметрПериодОтчета =
        БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
            ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки, "ПериодОтчета");

    РезультатФункции.Период = КонецДня(ПараметрПериодОтчета.Значение);

    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки, "ПериодОтчета", РезультатФункции.Период);
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "КонецПериода", Новый Граница(РезультатФункции.Период, ВидГраницы.Включая));

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 31.01.2025 [F00234022] Отчет Взаимозадолженность (для Вялых) --
