// Гарант+ Килипенко 27.01.2025 [F00233937] Отчет Расчет сумм задолженности для передачи в суд ++
#Область ПрограммныйИнтерфейс

Функция СформироватьДокументОтчета(Знач СтруктураДанныхЗаполнения, Знач ТабличныйДокумент = Неопределено, Знач Макет = Неопределено) Экспорт
    Макет = ?(Макет = Неопределено, ПолучитьОсновнойМакет(), Макет);
    ТабличныйДокумент = ?(ТабличныйДокумент = Неопределено, Новый ТабличныйДокумент, ТабличныйДокумент);

    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

    // За период
    Если ЗначениеЗаполнено(СтруктураДанныхЗаполнения.ОбщиеДанные.ПериодОтчета.ДатаНачала) Тогда
        ПредставлениеПериодаОтчета = ПредставлениеПериода(НачалоДня(СтруктураДанныхЗаполнения.ОбщиеДанные.ПериодОтчета.ДатаНачала),
                КонецДня(СтруктураДанныхЗаполнения.ОбщиеДанные.ПериодОтчета.ДатаОкончания), "ФП = Истина");

        ОбластьЗаголовок.Параметры.ПредставлениеПериода = СтрШаблон(НСтр("ru='за период: %1'"), ПредставлениеПериодаОтчета);
    КонецЕсли;
    ТабличныйДокумент.Вывести(ОбластьЗаголовок);

    ДанныеЗаполненияТЧ = ПодготовитьДанныеЗаполнения(СтруктураДанныхЗаполнения.ТаблицаИсходныхДанных);

    // Обход по Контрагенту
    СтруктураИтоговПоКонтрагенту = Новый Структура("Сумма, СуммаОплаты, СуммаЗадолженности", 0, 0, 0);
    Для Каждого СтрокаКонтрагента Из ДанныеЗаполненияТЧ.Начисления.Строки Цикл
        // Вывод Наименования таблицы
        ОбластьНаименованиеТаблицы = Макет.ПолучитьОбласть("НаименованиеТаблицы");
        ПолноеНаименованиеКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКонтрагента.Контрагент, "НаименованиеПолное");
        ОбластьНаименованиеТаблицы.Параметры.ПолноеНаименованиеКонтрагента = ПолноеНаименованиеКонтрагента;
        ОбластьНаименованиеТаблицы.Параметры.Контрагент = СтрокаКонтрагента.Контрагент;
        ТабличныйДокумент.Вывести(ОбластьНаименованиеТаблицы);

        // Вывод Заголовка таблицы
        ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
        ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);

        // Расчет суммы оплат для итога за период
        НайденныеСтрокиОплат = ДанныеЗаполненияТЧ.Оплаты.НайтиСтроки(
                Новый Структура("Контрагент, Учтено", СтрокаКонтрагента.Контрагент, 0));

        СуммаОплатыПоКонтрагенту = 0;
        СуммаОплатыПоКонтрагентуИзменена = Ложь;
        СуммаОплатыПоКонтрагентуУчтена = Ложь;
        Для Каждого СтрокаОплат Из НайденныеСтрокиОплат Цикл // Суммы оплат
            СуммаОплатыПоКонтрагенту = СуммаОплатыПоКонтрагенту + СтрокаОплат.Сумма;
            СтрокаОплат.Учтено = СтрокаОплат.Сумма;
        КонецЦикла;

        // Обход по Периоду (начало месяца)
        Для Каждого СтрокаПериода Из СтрокаКонтрагента.Строки Цикл
            ОбластиДляВывода = Новый Массив;

            ОбластьСтрокаТаблицыПериод = Макет.ПолучитьОбласть("СтрокаТаблицыПериод");
            ОбластьСтрокаТаблицыПериод.Параметры.Период = СтрокаПериода.Период;
            ОбластиДляВывода.Добавить(ОбластьСтрокаТаблицыПериод);

            // Обход по Документу расчетов (реализации)
            СоответствиеСтрокНоменклатур = Новый Соответствие;
            МассивДокументов = Новый Массив;
            Для Каждого СтрокаДокумента Из СтрокаПериода.Строки Цикл
                Если СуммаОплатыПоКонтрагентуУчтена = Ложь И СтрокаДокумента.Сумма <= СуммаОплатыПоКонтрагенту Тогда
                    СуммаОплатыПоКонтрагенту = СуммаОплатыПоКонтрагенту - СтрокаДокумента.Сумма;
                    СуммаОплатыПоКонтрагентуИзменена = Истина;
                    Продолжить; // Документ полностью оплачен
                ИначеЕсли СуммаОплатыПоКонтрагентуИзменена = Истина И СтрокаДокумента.Сумма > СуммаОплатыПоКонтрагенту Тогда
                    СуммаОплатыПоКонтрагентуУчтена = Истина;
                КонецЕсли;

                // Аккумуляция сумм по номенклатурным группам (для всех документов)
                Для Каждого СтрокаДанных Из СтрокаДокумента.Строки Цикл
                    Если СоответствиеСтрокНоменклатур.Получить(СтрокаДанных.НоменклатурнаяГруппа) = Неопределено Тогда
                        СоответствиеСтрокНоменклатур.Вставить(СтрокаДанных.НоменклатурнаяГруппа,
                            Новый Структура("Количество, Тариф, СуммаБезНДС, СуммаНДС, Сумма", 0, 0, 0, 0, 0));
                    КонецЕсли;

                    ТекущаяНомГруппа = СоответствиеСтрокНоменклатур.Получить(СтрокаДанных.НоменклатурнаяГруппа);
                    ТекущаяНомГруппа.Количество = ТекущаяНомГруппа.Количество + СтрокаДанных.Количество;
                    ТекущаяНомГруппа.СуммаБезНДС = ТекущаяНомГруппа.СуммаБезНДС + СтрокаДанных.СуммаБезНДС;
                    ТекущаяНомГруппа.СуммаНДС = ТекущаяНомГруппа.СуммаНДС + СтрокаДанных.СуммаНДС;
                    ТекущаяНомГруппа.Сумма = ТекущаяНомГруппа.Сумма + СтрокаДанных.Сумма;
                КонецЦикла;

                МассивДокументов.Добавить(СтрокаДокумента.ДокументНачисления);
            КонецЦикла; // Обход по Документу расчетов (реализации)

            // Удаление дублей документов
            ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивДокументов);

            // Заполнение детальных записей таблицы (по ном. группам)
            СуммаПоДокументам = 0;
            Для Каждого НомГруппаКЗ Из СоответствиеСтрокНоменклатур Цикл
                ОбластьСтрокаТаблицыНоменклатура = Макет.ПолучитьОбласть("СтрокаТаблицыНоменклатура");

                ОбластьСтрокаТаблицыНоменклатура.Параметры.Заполнить(НомГруппаКЗ.Значение);
                ОбластьСтрокаТаблицыНоменклатура.Параметры.НоменклатурнаяГруппаНаименование = Строка(НомГруппаКЗ.Ключ);
                ОбластьСтрокаТаблицыНоменклатура.Параметры.НоменклатурнаяГруппа = НомГруппаКЗ.Ключ;
                ОбластьСтрокаТаблицыНоменклатура.Параметры.Тариф = НомГруппаКЗ.Значение.СуммаБезНДС / НомГруппаКЗ.Значение.Количество;

                СуммаПоДокументам = СуммаПоДокументам + НомГруппаКЗ.Значение.Сумма;
                ОбластиДляВывода.Добавить(ОбластьСтрокаТаблицыНоменклатура);
            КонецЦикла;

            // Проверка наличия задолженности контрагента за текущий период
            Если СуммаПоДокументам <= 0 Тогда
                Продолжить; // !!! Нет Задолженностей за период, пропускаем строку
            КонецЕсли;

            // Вывод детальных записей таблицы
            Для Каждого ОбластьСтроки Из ОбластиДляВывода Цикл
                ТабличныйДокумент.Вывести(ОбластьСтроки);
            КонецЦикла;

            // Заполнение итогов по контрагенту за текущей период
            ОбластьСтрокаТаблицыИтогиЗаПериод = Макет.ПолучитьОбласть("СтрокаТаблицыИтогиЗаПериод");
            ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.Сумма = СуммаПоДокументам;
            ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.Документ = Неопределено;
            ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление = "";
            Для Каждого ТекущийДокумент Из МассивДокументов Цикл
                ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.Документ = ТекущийДокумент; // Расшифровка

                // Формирование представления списка документов
                ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление =
                    СтрШаблон("%1; %2", ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление, ТекущийДокумент);
            КонецЦикла;

            // Очистка списка документов от ведущего разделителя (,)
            Если СтрДлина(ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление) > 0 Тогда
                ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление =
                    Сред(ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление, 3);
            КонецЕсли;

            // Заполнение задолженности за период по контрагенту
            ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаОплаты =
                Мин(СуммаОплатыПоКонтрагенту, ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.Сумма); // Сумма оплат
            ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаЗадолженности =
                СуммаПоДокументам - СуммаОплатыПоКонтрагенту; // Остаток задолженности

            // Вывод итога за период
            ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыИтогиЗаПериод);

            // Перерасчет остатка суммы оплат
            СуммаОплатыПоКонтрагенту = СуммаОплатыПоКонтрагенту - ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаОплаты;

            // Накопление итогов по контрагенту
            СтруктураИтоговПоКонтрагенту.Сумма = СтруктураИтоговПоКонтрагенту.Сумма + ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.Сумма;
            СтруктураИтоговПоКонтрагенту.СуммаОплаты = СтруктураИтоговПоКонтрагенту.СуммаОплаты
                + ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаОплаты;
            СтруктураИтоговПоКонтрагенту.СуммаЗадолженности = СтруктураИтоговПоКонтрагенту.СуммаЗадолженности
                + ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаЗадолженности;
        КонецЦикла; // Обход по Периоду

        // Заполнение строки итогов по Контрагенту
        ОбластьИтогиПоКонтрагенту = Макет.ПолучитьОбласть("ИтогиПоКонтрагенту");
        ОбластьИтогиПоКонтрагенту.Параметры.Сумма = СтруктураИтоговПоКонтрагенту.Сумма;
        ОбластьИтогиПоКонтрагенту.Параметры.СуммаОплаты = СтруктураИтоговПоКонтрагенту.СуммаОплаты;
        ОбластьИтогиПоКонтрагенту.Параметры.СуммаЗадолженности = СтруктураИтоговПоКонтрагенту.СуммаЗадолженности;

        // Вывод строки итогов по Контрагенту
        ТабличныйДокумент.Вывести(ОбластьИтогиПоКонтрагенту);

        // Вывод подвала по Контрагенту
        ОбластьПодвал.Параметры.ИОФНачальникСлужбыРеализации = ПолучитьИОФНачальникаСлужбыРеализации();
        ТабличныйДокумент.Вывести(ОбластьПодвал);
    КонецЦикла; // Обход по Контрагенту

    Возврат ТабличныйДокумент;
КонецФункции

// Формирует документ отчета без заполнения данных по погашению задолженности (оплатам)
Функция СформироватьДокументОтчетаУпрощенный(
        Знач СтруктураДанныхЗаполнения, Знач ТабличныйДокумент = Неопределено, Знач Макет = Неопределено) Экспорт

    Макет = ?(Макет = Неопределено, ПолучитьОсновнойМакет(), Макет);
    ТабличныйДокумент = ?(ТабличныйДокумент = Неопределено, Новый ТабличныйДокумент, ТабличныйДокумент);

    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

    // За период
    Если ЗначениеЗаполнено(СтруктураДанныхЗаполнения.ОбщиеДанные.ПериодОтчета.ДатаНачала) Тогда
        ПредставлениеПериодаОтчета = ПредставлениеПериода(НачалоДня(СтруктураДанныхЗаполнения.ОбщиеДанные.ПериодОтчета.ДатаНачала),
                КонецДня(СтруктураДанныхЗаполнения.ОбщиеДанные.ПериодОтчета.ДатаОкончания), "ФП = Истина");

        ОбластьЗаголовок.Параметры.ПредставлениеПериода = СтрШаблон(НСтр("ru='за период: %1'"), ПредставлениеПериодаОтчета);
    КонецЕсли;
    ТабличныйДокумент.Вывести(ОбластьЗаголовок);

    ДанныеЗаполненияТЧ = ПодготовитьДанныеЗаполнения(СтруктураДанныхЗаполнения.ТаблицаИсходныхДанных);

    // Обход по Контрагенту
    СтруктураИтоговПоКонтрагенту = Новый Структура("Сумма, СуммаОплаты, СуммаЗадолженности", 0, 0, 0);
    Для Каждого СтрокаКонтрагента Из ДанныеЗаполненияТЧ.Начисления.Строки Цикл
        // Вывод Наименования таблицы
        ОбластьНаименованиеТаблицы = Макет.ПолучитьОбласть("НаименованиеТаблицы");
        ПолноеНаименованиеКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКонтрагента.Контрагент, "НаименованиеПолное");
        ОбластьНаименованиеТаблицы.Параметры.ПолноеНаименованиеКонтрагента = ПолноеНаименованиеКонтрагента;
        ОбластьНаименованиеТаблицы.Параметры.Контрагент = СтрокаКонтрагента.Контрагент;
        ТабличныйДокумент.Вывести(ОбластьНаименованиеТаблицы);

        // Вывод Заголовка таблицы
        ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
        ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);

        // // Расчет суммы оплат для итога за период
        // НайденныеСтрокиОплат = ДанныеЗаполненияТЧ.Оплаты.НайтиСтроки(
        //         Новый Структура("Контрагент, Учтено", СтрокаКонтрагента.Контрагент, 0));

        СуммаОплатыПоКонтрагенту = 0;
        // СуммаОплатыПоКонтрагентуИзменена = Ложь;
        // СуммаОплатыПоКонтрагентуУчтена = Ложь;
        // Для Каждого СтрокаОплат Из НайденныеСтрокиОплат Цикл // Суммы оплат
        //     СуммаОплатыПоКонтрагенту = СуммаОплатыПоКонтрагенту + СтрокаОплат.Сумма;
        //     СтрокаОплат.Учтено = СтрокаОплат.Сумма;
        // КонецЦикла;

        // Обход по Периоду (начало месяца)
        Для Каждого СтрокаПериода Из СтрокаКонтрагента.Строки Цикл
            ОбластиДляВывода = Новый Массив;

            ОбластьСтрокаТаблицыПериод = Макет.ПолучитьОбласть("СтрокаТаблицыПериод");
            ОбластьСтрокаТаблицыПериод.Параметры.Период = СтрокаПериода.Период;
            ОбластиДляВывода.Добавить(ОбластьСтрокаТаблицыПериод);

            // Обход по Документу расчетов (реализации)
            СоответствиеСтрокНоменклатур = Новый Соответствие;
            МассивДокументов = Новый Массив;
            Для Каждого СтрокаДокумента Из СтрокаПериода.Строки Цикл
                // Если СуммаОплатыПоКонтрагентуУчтена = Ложь И СтрокаДокумента.Сумма <= СуммаОплатыПоКонтрагенту Тогда
                //     СуммаОплатыПоКонтрагенту = СуммаОплатыПоКонтрагенту - СтрокаДокумента.Сумма;
                //     СуммаОплатыПоКонтрагентуИзменена = Истина;
                //     Продолжить; // Документ полностью оплачен
                // ИначеЕсли СуммаОплатыПоКонтрагентуИзменена = Истина И СтрокаДокумента.Сумма > СуммаОплатыПоКонтрагенту Тогда
                //     СуммаОплатыПоКонтрагентуУчтена = Истина;
                // КонецЕсли;

                // Аккумуляция сумм по номенклатурным группам (для всех документов)
                Для Каждого СтрокаДанных Из СтрокаДокумента.Строки Цикл
                    Если СоответствиеСтрокНоменклатур.Получить(СтрокаДанных.НоменклатурнаяГруппа) = Неопределено Тогда
                        СоответствиеСтрокНоменклатур.Вставить(СтрокаДанных.НоменклатурнаяГруппа,
                            Новый Структура("Количество, Тариф, СуммаБезНДС, СуммаНДС, Сумма", 0, 0, 0, 0, 0));
                    КонецЕсли;

                    ТекущаяНомГруппа = СоответствиеСтрокНоменклатур.Получить(СтрокаДанных.НоменклатурнаяГруппа);
                    ТекущаяНомГруппа.Количество = ТекущаяНомГруппа.Количество + СтрокаДанных.Количество;
                    ТекущаяНомГруппа.СуммаБезНДС = ТекущаяНомГруппа.СуммаБезНДС + СтрокаДанных.СуммаБезНДС;
                    ТекущаяНомГруппа.СуммаНДС = ТекущаяНомГруппа.СуммаНДС + СтрокаДанных.СуммаНДС;
                    ТекущаяНомГруппа.Сумма = ТекущаяНомГруппа.Сумма + СтрокаДанных.Сумма;
                КонецЦикла;

                МассивДокументов.Добавить(СтрокаДокумента.ДокументНачисления);
            КонецЦикла; // Обход по Документу расчетов (реализации)

            // Удаление дублей документов
            ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивДокументов);

            // Заполнение детальных записей таблицы (по ном. группам)
            СуммаПоДокументам = 0;
            Для Каждого НомГруппаКЗ Из СоответствиеСтрокНоменклатур Цикл
                ОбластьСтрокаТаблицыНоменклатура = Макет.ПолучитьОбласть("СтрокаТаблицыНоменклатура");

                ОбластьСтрокаТаблицыНоменклатура.Параметры.Заполнить(НомГруппаКЗ.Значение);
                ОбластьСтрокаТаблицыНоменклатура.Параметры.НоменклатурнаяГруппаНаименование = Строка(НомГруппаКЗ.Ключ);
                ОбластьСтрокаТаблицыНоменклатура.Параметры.НоменклатурнаяГруппа = НомГруппаКЗ.Ключ;
                ОбластьСтрокаТаблицыНоменклатура.Параметры.Тариф = НомГруппаКЗ.Значение.СуммаБезНДС / НомГруппаКЗ.Значение.Количество;

                СуммаПоДокументам = СуммаПоДокументам + НомГруппаКЗ.Значение.Сумма;
                ОбластиДляВывода.Добавить(ОбластьСтрокаТаблицыНоменклатура);
            КонецЦикла;

            // Проверка наличия задолженности контрагента за текущий период
            Если СуммаПоДокументам <= 0 Тогда
                Продолжить; // !!! Нет Задолженностей за период, пропускаем строку
            КонецЕсли;

            // Вывод детальных записей таблицы
            Для Каждого ОбластьСтроки Из ОбластиДляВывода Цикл
                ТабличныйДокумент.Вывести(ОбластьСтроки);
            КонецЦикла;

            // Заполнение итогов по контрагенту за текущей период
            ОбластьСтрокаТаблицыИтогиЗаПериод = Макет.ПолучитьОбласть("СтрокаТаблицыИтогиЗаПериод");
            ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.Сумма = СуммаПоДокументам;
            ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.Документ = Неопределено;
            ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление = "";
            Для Каждого ТекущийДокумент Из МассивДокументов Цикл
                ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.Документ = ТекущийДокумент; // Расшифровка

                // Формирование представления списка документов
                ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление =
                    СтрШаблон("%1; %2", ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление, ТекущийДокумент);
            КонецЦикла;

            // Очистка списка документов от ведущего разделителя (,)
            Если СтрДлина(ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление) > 0 Тогда
                ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление =
                    Сред(ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.ДокументПредставление, 3);
            КонецЕсли;

            // Заполнение задолженности за период по контрагенту
            // ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаОплаты =
            //     Мин(СуммаОплатыПоКонтрагенту, ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.Сумма); // Сумма оплат
            ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаОплаты = 0; // Не заполняем данные оплат
            ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаЗадолженности =
                СуммаПоДокументам - СуммаОплатыПоКонтрагенту; // Остаток задолженности

            // Вывод итога за период
            ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыИтогиЗаПериод);

            // Перерасчет остатка суммы оплат
            СуммаОплатыПоКонтрагенту = СуммаОплатыПоКонтрагенту - ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаОплаты;

            // Накопление итогов по контрагенту
            СтруктураИтоговПоКонтрагенту.Сумма = СтруктураИтоговПоКонтрагенту.Сумма + ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.Сумма;
            СтруктураИтоговПоКонтрагенту.СуммаОплаты = СтруктураИтоговПоКонтрагенту.СуммаОплаты
                + ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаОплаты;
            СтруктураИтоговПоКонтрагенту.СуммаЗадолженности = СтруктураИтоговПоКонтрагенту.СуммаЗадолженности
                + ОбластьСтрокаТаблицыИтогиЗаПериод.Параметры.СуммаЗадолженности;
        КонецЦикла; // Обход по Периоду

        // Заполнение строки итогов по Контрагенту
        ОбластьИтогиПоКонтрагенту = Макет.ПолучитьОбласть("ИтогиПоКонтрагенту");
        ОбластьИтогиПоКонтрагенту.Параметры.Сумма = СтруктураИтоговПоКонтрагенту.Сумма;
        ОбластьИтогиПоКонтрагенту.Параметры.СуммаОплаты = СтруктураИтоговПоКонтрагенту.СуммаОплаты;
        ОбластьИтогиПоКонтрагенту.Параметры.СуммаЗадолженности = СтруктураИтоговПоКонтрагенту.СуммаЗадолженности;

        // Вывод строки итогов по Контрагенту
        ТабличныйДокумент.Вывести(ОбластьИтогиПоКонтрагенту);

        // Вывод подвала по Контрагенту
        ОбластьПодвал.Параметры.ИОФНачальникСлужбыРеализации = ПолучитьИОФНачальникаСлужбыРеализации();
        ТабличныйДокумент.Вывести(ОбластьПодвал);
    КонецЦикла; // Обход по Контрагенту

    Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьИОФНачальникаСлужбыРеализации() Экспорт
    Возврат "А.В. Носенков";
КонецФункции

Функция ПолучитьОсновнойМакет() Экспорт
    Возврат Отчеты.ГП_РасчетЗадолженностиДляПередачиСуд.ПолучитьМакет("ПФ_Макет");
КонецФункции

Функция ПодготовитьДанныеЗаполнения(Знач ТаблицаИсходныхДанных) Экспорт
    МВТ = Новый МенеджерВременныхТаблиц;
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МВТ;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   *
        |ПОМЕСТИТЬ ВТ_ТаблицаИсходныхДанных
        |ИЗ
        |   &ТаблицаИсходныхДанных КАК ТаблицаИсходныхДанных
        |;
        |
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   Месяц КАК Месяц,
        |   Контрагент КАК Контрагент,
        |   НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |   ДокументНачисления КАК ДокументНачисления,
        |   СУММА(СуммаНачисления) КАК СуммаНачисления,
        |   СУММА(СуммаБезНДСНачисления) КАК СуммаБезНДСНачисления,
        |   СУММА(СуммаНДСНачисления) КАК СуммаНДСНачисления,
        |   СУММА(КоличествоНачисления) КАК КоличествоНачисления
        |ПОМЕСТИТЬ ВТ_ТаблицаИсходныхДанных_Подготовка
        |ИЗ
        |   ВТ_ТаблицаИсходныхДанных КАК ВТ_ТаблицаИсходныхДанных
        |СГРУППИРОВАТЬ ПО
        |   Месяц,
        |   Контрагент,
        |   НоменклатурнаяГруппа,
        |   ДокументНачисления
        |ИМЕЮЩИЕ
        |   ДокументНачисления <> НЕОПРЕДЕЛЕНО
        |;";

    Запрос.УстановитьПараметр("ТаблицаИсходныхДанных", ТаблицаИсходныхДанных);
    Запрос.Выполнить(); // Формирование Временных таблиц

    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МВТ;
    Запрос.Текст =
        "// Результат [0] Начисления
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   Месяц КАК Период,
        |   Контрагент КАК Контрагент,
        |   НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |   ДокументНачисления КАК ДокументНачисления,
        |   СуммаНачисления КАК Сумма,
        |   СуммаБезНДСНачисления КАК СуммаБезНДС,
        |   СуммаНДСНачисления КАК СуммаНДС,
        |   КоличествоНачисления КАК Количество
        |ИЗ
        |   ВТ_ТаблицаИсходныхДанных_Подготовка КАК ВТ_ТаблицаИсходныхДанных
        |
        |УПОРЯДОЧИТЬ ПО
        |   Контрагент,
        |   Месяц,
        |   ДокументНачисления.Дата,
        |   ДокументНачисления.Сумма,
        |   НоменклатурнаяГруппа
        |ИТОГИ
        |   СУММА(СуммаНачисления),
        |   СУММА(СуммаБезНДСНачисления),
        |   СУММА(СуммаНДСНачисления),
        |   СУММА(КоличествоНачисления)
        |ПО
        |   Контрагент,
        |   Месяц,
        |   ДокументНачисления
        |;
        |
        |// Результат [1] Оплаты
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   Месяц КАК Период,
        |   Контрагент КАК Контрагент,
        |   ДокументОплаты КАК ДокументОплаты,
        |   СУММА(СуммаОплаты) КАК Сумма,
        |   СУММА(СуммаБезНДСОплаты) КАК СуммаБезНДС,
        |   СУММА(СуммаНДСОплаты) КАК СуммаНДС,
        |   ВЫРАЗИТЬ(0 КАК ЧИСЛО(21, 2)) КАК Учтено
        |ИЗ
        |   ВТ_ТаблицаИсходныхДанных КАК ВТ_ТаблицаИсходныхДанных
        |
        |СГРУППИРОВАТЬ ПО
        |   ВТ_ТаблицаИсходныхДанных.Месяц,
        |   Контрагент,
        |   ДокументОплаты
        |ИМЕЮЩИЕ
        |   ДокументОплаты <> НЕОПРЕДЕЛЕНО
        |УПОРЯДОЧИТЬ ПО
        |   Контрагент,
        |   Месяц,
        |   ДокументОплаты
        |;
        |";

    РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();

    ДеревоНачислений = РезультатПакетаЗапросов[0].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
    ТаблицаОплат = РезультатПакетаЗапросов[1].Выгрузить();

    РезультатФункции = Новый Структура("Начисления, Оплаты", ДеревоНачислений, ТаблицаОплат);
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 27.01.2025 [F00233937] Отчет Расчет сумм задолженности для передачи в суд --
