// Гарант+ Килипенко 09.10.2024 [F00228925] Отчет по клиентам ++
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;

    ИнициализироватьПараметры();

    ЭтоРасшифровкаОтчета = ЭтоРасшифровкаОтчета();

    ГруппировкаПериодРеализации = ПолучитьГруппировкуПериодРеализации();
    Если ГруппировкаПериодРеализации <> Неопределено Тогда
        ГруппировкаПериодРеализации.Использование = ?(ЭтоРасшифровкаОтчета, Ложь, ЭтоВариантОтчетаСПериодамиРеализации());
    КонецЕсли;

    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных,
            ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);

    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    МВТ = Новый МенеджерВременныхТаблиц;

    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина, Истина, МВТ);

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
// Гарант+ Килипенко 09.10.2024 [F00228925] Отчет по клиентам --

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьПараметры()
    // Установка границ периода отчета
    УточнитьПараметрыПериодаОтчета();

    НомГруппаВодоотведение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаВодоотведение");
    НомГруппаВодоотведение.Значение = Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000002", Истина); // Водоотведение
    НомГруппаВодоотведение.Использование = Истина;

    НоменклатураВодоотведение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НоменклатураВодоотведение");
    НоменклатураВодоотведение.Значение = Справочники.Номенклатура.НайтиПоКоду("00-00000007", Ложь); // Водоотведение (номенклатура)
    НоменклатураВодоотведение.Использование = Истина;

    НомГруппаВодоснабжение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаВодоснабжение");
    НомГруппаВодоснабжение.Значение =
        Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000001", Истина); // Водоснабжение
    НомГруппаВодоснабжение.Использование = Истина;

    СписокНомГруппНВ = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СписокНомГруппНВ");
    СписокНомГруппНВ.Значение = Новый СписокЗначений;
    СписокНомГруппНВ.Значение.Добавить(
        Справочники.НоменклатурныеГруппы.НайтиПоКоду(
            "0000158", Истина)); // Негативное воздействие
    СписокНомГруппНВ.Использование = Истина;

    НоменклатураХВС = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НоменклатураХВС");
    НоменклатураХВС.Значение =
        Справочники.Номенклатура.НайтиПоКоду("00-00000003", Ложь); // Холодное водоснабжение (номенклатура)
    НоменклатураХВС.Использование = Истина;

    НомГруппаНВ = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаНВ");
    НомГруппаНВ.Значение =
        Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000158", Истина); // Негативное воздействие
    НомГруппаНВ.Использование = Истина;
КонецПроцедуры

Функция УточнитьПараметрыПериодаОтчета()
    РезультатФункции = Новый Структура("ДатаНачала, ДатаОкончания", Дата(1, 1, 1), Дата(1, 1, 1));

    ПараметрПериодОтчета =
        БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(ЭтотОбъект.КомпоновщикНастроек, "ПериодОтчета");

    РезультатФункции.ДатаНачала = НачалоДня(ПараметрПериодОтчета.Значение.ДатаНачала);
    РезультатФункции.ДатаОкончания = КонецДня(ПараметрПериодОтчета.Значение.ДатаОкончания);

    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "НачалоПериодаГраница", Новый Граница(РезультатФункции.ДатаНачала, ВидГраницы.Включая));
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "КонецПериодааГраница", Новый Граница(РезультатФункции.ДатаОкончания, ВидГраницы.Включая));

    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "НачалоПериода", РезультатФункции.ДатаНачала);
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "КонецПериода", РезультатФункции.ДатаОкончания);

    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек, "Организация", УПЖКХ_ТиповыеМетодыВызовСервера.ПолучитьОсновнуюОрганизацию());

    Возврат РезультатФункции;
КонецФункции

Функция ПолучитьГруппировкуПериодРеализации()
    Возврат ГП_РаботаСОтчетами.ПолучитьГруппировкуСтруктурыОтчетаПоНаименованию(
        ЭтотОбъект.КомпоновщикНастроек.Настройки.Структура,
        "ГруппировкаПериодРеализации", Ложь);
КонецФункции

// Возвращаемое значение:
// - Булево
Функция ЭтоВариантОтчетаСПериодамиРеализации()
    ПараметрПоПериодамРеализации =
        БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
            ЭтотОбъект.КомпоновщикНастроек, "ФормироватьПоПериодамРеализации");

    Возврат ?(ПараметрПоПериодамРеализации.Значение = Неопределено,
            ПараметрПоПериодамРеализации.Использование, ПараметрПоПериодамРеализации.Значение);
КонецФункции

// Возвращаемое значение:
// - Булево
Функция ЭтоРасшифровкаОтчета()
    Возврат ГП_РаботаСОтчетами.ЭтоРасшифровкаОтчета(ЭтотОбъект.КомпоновщикНастроек.Настройки);
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
