
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.ПС_Выручка.Значение = ПланыСчетов.Хозрасчетный.Выручка;
    ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.ПС_НДСА.Значение = ПланыСчетов.Хозрасчетный.Продажи_НДС;
    ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.ПС_РасчетыСПокупателямиИЗаказчиками.Значение = 
        ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками;
        
    //ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(
    //    ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос, 
    //    "РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&ПС_РасчетыСПокупателямиИЗаказчиками), , КорСчет В ИЕРАРХИИ (&ПС_Выручка)) КАК ХозрасчетныйОбороты",
    //    "РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&ПС_РасчетыСПокупателямиИЗаказчиками), , , КорСчет В ИЕРАРХИИ (&ПС_Выручка)) КАК ХозрасчетныйОборот");
КонецПроцедуры
