
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)       
    НомГруппаВодоотведение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаВодоотведение");
    НомГруппаВодоотведение.Значение = Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000002", Истина); // Водоотведение
    НомГруппаВодоотведение.Использование = Истина;
    
    НоменклатураВодоотведение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НоменклатураВодоотведение");
    НоменклатураВодоотведение.Значение = Справочники.Номенклатура.НайтиПоКоду("00-00000007", Ложь); // Водоотведение
    НоменклатураВодоотведение.Использование = Истина;
    
    НомГруппаВодоснабжение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаВодоснабжение");
    НомГруппаВодоснабжение.Значение = 
        Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000001", Истина); // Водоснабжение
    НомГруппаВодоснабжение.Использование = Истина;
    
    СписокНомГруппНВ = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СписокНомГруппНВ");
    СписокНомГруппНВ.Значение = Новый СписокЗначений;
    //СписокНомГруппНВ.Значение.Добавить( 
    //    Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Негативное воздействие", Истина));
    СписокНомГруппНВ.Значение.Добавить( 
        Справочники.НоменклатурныеГруппы.НайтиПоКоду(
            "0000158", Истина)); // Негативное воздействие
    СписокНомГруппНВ.Использование = Истина;
    
    НоменклатураХВС = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НоменклатураХВС");
    НоменклатураХВС.Значение =
        Справочники.Номенклатура.НайтиПоКоду("00-00000003", Ложь); // Холодное водоснабжение
    НоменклатураХВС.Использование = Истина;
    
    НомГруппаНВ = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаНВ");
    НомГруппаНВ.Значение =
        Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000158", Истина); // Негативное воздействие
    НомГруппаНВ.Использование = Истина;
КонецПроцедуры
