// Гарант+ Килипенко 09.10.2024 [F00228925] Отчет по клиентам ++
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    НомГруппаВодоотведение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаВодоотведение");
    НомГруппаВодоотведение.Значение = Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000002", Истина); // Водоотведение
    НомГруппаВодоотведение.Использование = Истина;

    НоменклатураВодоотведение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НоменклатураВодоотведение");
    НоменклатураВодоотведение.Значение = Справочники.Номенклатура.НайтиПоКоду("00-00000007", Ложь); // Водоотведение (номенклатура)
    НоменклатураВодоотведение.Использование = Истина;

    НомГруппаВодоснабжение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаВодоснабжение");
    НомГруппаВодоснабжение.Значение =
        Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000001", Истина); // Водоснабжение
    НомГруппаВодоснабжение.Использование = Истина;

    СписокНомГруппНВ = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СписокНомГруппНВ");
    СписокНомГруппНВ.Значение = Новый СписокЗначений;
    СписокНомГруппНВ.Значение.Добавить(
        Справочники.НоменклатурныеГруппы.НайтиПоКоду(
            "0000158", Истина)); // Негативное воздействие
    СписокНомГруппНВ.Использование = Истина;

    НоменклатураХВС = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НоменклатураХВС");
    НоменклатураХВС.Значение =
        Справочники.Номенклатура.НайтиПоКоду("00-00000003", Ложь); // Холодное водоснабжение (номенклатура)
    НоменклатураХВС.Использование = Истина;

    НомГруппаНВ = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаНВ");
    НомГруппаНВ.Значение =
        Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000158", Истина); // Негативное воздействие
    НомГруппаНВ.Использование = Истина;

    ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТ_lc_ДинамическиеПоказателиЛицевыхСчетов",
            "РегистрСведений.lc_ДинамическиеПоказателиЛицевыхСчетов.СрезПоследних(&КонецПериода, )");
    ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = ТекстЗапроса;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
// Гарант+ Килипенко 09.10.2024 [F00228925] Отчет по клиентам --
