
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)       
    НомГруппаВодоотведение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаВодоотведение");
    НомГруппаВодоотведение.Значение = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Водоотведение", Истина);
    НомГруппаВодоотведение.Использование = Истина;
    
    НоменклатураВодоотведение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НоменклатураВодоотведение");
    НоменклатураВодоотведение.Значение = Справочники.Номенклатура.НайтиПоНаименованию("Водоотведение", Истина);
    НоменклатураВодоотведение.Использование = Истина;
        
    НомГруппаВодоснабжение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаВодоснабжение");
    НомГруппаВодоснабжение.Значение = 
        Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Водоснабжение", Истина);
    НомГруппаВодоснабжение.Использование = Истина;
    
    СписокНомГруппНВ = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СписокНомГруппНВ");
    СписокНомГруппНВ.Значение = Новый СписокЗначений;
    СписокНомГруппНВ.Значение.Добавить( 
        Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Негативное воздействие", Истина));
    СписокНомГруппНВ.Значение.Добавить( 
        Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(
            "Плата за негативное воздействие на работу централиз. системы водоотведения", Истина));
    СписокНомГруппНВ.Использование = Истина;
    
    НоменклатураХВС = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НоменклатураХВС");
    НоменклатураХВС.Значение =
        Справочники.Номенклатура.НайтиПоНаименованию("Холодное водоснабжение", Истина);
    НоменклатураХВС.Использование = Истина;
    
    НомГруппаНВ = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаНВ");
    НомГруппаНВ.Значение =
        Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Негативное воздействие", Истина);
    НомГруппаНВ.Использование = Истина;
КонецПроцедуры
