#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;

    ИнициализироватьПараметры();

    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных,
            ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(),
            ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    МВТ = Новый МенеджерВременныхТаблиц;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина, Истина, МВТ);

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ДанныеЗаполнения = Новый ТаблицаЗначений;
    ДанныеЗаполнения = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

    ПараметрПериод = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки, "Период");

    // ДокументРезультат = Отчеты.ГП_ОСВПоАбоненту.СформироватьТабличныйДокументАктаОСВПоАбонентуПоДаннымЗаполнения(
    //     ДанныеЗаполнения, ДанныеЗаполненияШапки, ДокументРезультат);
    ДокументРезультат = СформироватьТабличныйДокумент(Новый Структура("Дата", ПараметрПериод.Значение), ДанныеЗаполнения, ДокументРезультат);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьПараметры()
    // Установка границ периода отчета
    УточнитьПараметрыПериодаОтчета();

    // Заполняем параметр ВидыСубконто
    ВидыСубконто = Новый СписокЗначений;
    ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
    ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
    ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "ВидыСубконто", ВидыСубконто);

    // Заполняем параметр ФильтрСписокСчетов
    ФильтрСписокСчетов = ПолучитьСчета();
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "ФильтрСписокСчетов", ФильтрСписокСчетов);

    ПараметрФильтрСписокСчетов =
        БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
            ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки, "ФильтрСписокСчетов");
    Если ПараметрФильтрСписокСчетов <> Неопределено
                И (ПараметрФильтрСписокСчетов.Значение = Неопределено
                    ИЛИ ПараметрФильтрСписокСчетов.Значение.Количество() = 0) Тогда
        БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
            ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки, "ФильтрСписокСчетов", ФильтрСписокСчетов);
    КонецЕсли;
КонецПроцедуры

Функция УточнитьПараметрыПериодаОтчета()
    //РезультатФункции = Новый Структура("Период", Дата(1, 1, 1));
    //
    //ПараметрПериодОтчета =
    //    БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(
    //        ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки, "Период");
    //
    //РезультатФункции.Период = Новый Граница(КонецДня(ПараметрПериодОтчета.Значение), ВидГраницы.Включая);
    //
    //БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
    //    ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки, "Период", РезультатФункции.Период);
    //
    //Возврат РезультатФункции;
КонецФункции

Функция ПолучитьСчета()
    РезультатФункции = Новый СписокЗначений;
    РезультатФункции.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01"));
    Возврат РезультатФункции;
КонецФункции

// Возвращаемое значение:
//  - ТабличныйДокумент
Функция ПолучитьМакетаАктаОСВПоАбоненту()
    Возврат Отчеты.ГП_ОтчетПоДебиторам.ПолучитьМакет("ПФ_MXL_Макет");
КонецФункции

Функция ПолучитьФИОПредставителя(Знач ДанныеЗаполненияШапки)
    РезультатФункции = "Антипова О.А."; // Фиксированно по ТЗ;

    ОтветственныеЛицаОрганизации = ОтветственныеЛицаБППовтИсп.ОтветственныеЛица(
        ДанныеЗаполненияШапки.Организация, ДанныеЗаполненияШапки.ДатаАктаСверки);

    Если ОтветственныеЛицаОрганизации.Свойство("ГлавныйБухгалтерФИО") Тогда
        РезультатФункции = ОтветственныеЛицаОрганизации.ГлавныйБухгалтерФИО.Представление;
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

Функция СформироватьТабличныйДокумент(Знач ОбщиеДанные, Знач ДанныеЗаполнения, ТабличныйДокумент)
    Макет = ?(Макет = Неопределено, ПолучитьМакетаАктаОСВПоАбоненту(), Макет);

    УстановитьПривилегированныйРежим(Истина);

    ТабличныйДокумент = ?(ТабличныйДокумент = Неопределено, Новый ТабличныйДокумент, ТабличныйДокумент);
    ТабличныйДокумент.ПолеСлева = 5;
    ТабличныйДокумент.ПолеСправа = 5;
    ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
    ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
    ТабличныйДокумент.АвтоМасштаб = Истина;
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.ТолькоПросмотр = Истина;

    ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ГП_ОтчетПоДебиторам_ОтчетПоДебиторам";

    Если ДанныеЗаполнения.Количество() = 0 Тогда
        // Документ без данных
        ОбщегоНазначения.СообщитьПользователю("Данные отсутствуют");
        Возврат ТабличныйДокумент;
    КонецЕсли;

    // Общие реквизиты шапки
    ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");

    // Данные участников
    // СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(
    //     ОбщиеДанные.Организация, ОбщиеДанные.Дата);
    // НазваниеОрганизации = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;

    ОбластьМакета.Параметры.Дата = ОбщиеДанные.Дата;
    ТабличныйДокумент.Вывести(ОбластьМакета);

    // Создаем массив для проверки вывода
    МассивВыводимыхОбластей = Новый Массив;

    // Выводим многострочную часть документа
    ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
    ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщийИтогТаблицы");
    ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");

    СтруктураИтогов = Новый Структура("Сумма, СуммаПросрочено", 0, 0);

    КоличествоСтрокДанныхТЧ = ДанныеЗаполнения.Количество();
    НомерСтроки = 0;
    Для Каждого СтрокаДанныхТЧ Из ДанныеЗаполнения Цикл
        ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");

        НомерСтроки = НомерСтроки + 1;

        ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
        ОбластьМакета.Параметры.Контрагент = СтрокаДанныхТЧ.Контрагент;
        ОбластьМакета.Параметры.ЮрАдрес = СтрокаДанныхТЧ.ПредставлениеАдреса;
        ОбластьМакета.Параметры.РасчетныйСчет = СтрокаДанныхТЧ.НомерСчета;
        ОбластьМакета.Параметры.Сумма = СтрокаДанныхТЧ.СуммаКонечныйОстаток;
        ОбластьМакета.Параметры.СуммаПросрочено = 0; // !! Временно
        ОбластьМакета.Параметры.ПредставлениеБанка = СтрокаДанныхТЧ.ПредставлениеАдресаБанка;
        ОбластьМакета.Параметры.НомерКорСчета = СтрокаДанныхТЧ.КоррСчетБанка;

        СтруктураИтогов.Сумма = СтруктураИтогов.Сумма + СтрокаДанныхТЧ.СуммаКонечныйОстаток;

        Если НомерСтроки = 1 Тогда
            ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
        Иначе
            МассивВыводимыхОбластей.Очистить();
            МассивВыводимыхОбластей.Добавить(ОбластьМакета);
            Если НомерСтроки = КоличествоСтрокДанныхТЧ Тогда
                МассивВыводимыхОбластей.Добавить(ОбластьОбщийИтог);
                МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
            КонецЕсли;
            //Если НомерСтроки <> 1 И НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
            //    ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
            //    ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
            //КонецЕсли;
        КонецЕсли;

        ТабличныйДокумент.Вывести(ОбластьМакета);

    КонецЦикла;

    ОбластьОбщийИтог.Параметры.Заполнить(СтруктураИтогов);
    ТабличныйДокумент.Вывести(ОбластьОбщийИтог);

    //ОбластьПодвала.Параметры.Заполнить(ДанныеЗаполненияШапки);
    //ОбластьПодвала.Параметры.ФИОПредставителя = ПолучитьФИОПредставителя(ДанныеЗаполненияШапки);
    //ОбластьПодвала.Параметры.НазваниеОрганизации = НазваниеОрганизации;
    //ОбластьПодвала.Параметры.НаименованиеКонтрагента = НаименованиеКонтрагента;
    ТабличныйДокумент.Вывести(ОбластьПодвала);

    Если ПривилегированныйРежим() Тогда
        УстановитьПривилегированныйРежим(Ложь);
    КонецЕсли;

    Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
