#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТаблицуДинамическихПоказателей(Знач Период, Знач МВТ = Неопределено) Экспорт
    Запрос = Новый Запрос;
    Если МВТ <> Неопределено Тогда
        Запрос.МенеджерВременныхТаблиц = МВТ;
    КонецЕсли;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ДинамическиеПоказателиЛицевыхСчетов.ЛицевойСчет КАК ЛицевойСчет,
        |	ДинамическиеПоказателиЛицевыхСчетов.ВидПотребления КАК ВидПотребления,
        |	ДинамическиеПоказателиЛицевыхСчетов.Финансирование КАК СпособФинансирования,
        |	ДинамическиеПоказателиЛицевыхСчетов.Водозабор КАК Водозабор,
        |	ДинамическиеПоказателиЛицевыхСчетов.Договородержатель КАК Договородержатель,
        |	ДинамическиеПоказателиЛицевыхСчетов.Контролер КАК Контролер,
        |	ДинамическиеПоказателиЛицевыхСчетов.Характеристика КАК Характеристика
        |ПОМЕСТИТЬ ВТ_ДинамическиеПоказателиЛицевыхСчетов
        |ИЗ
        |	РегистрСведений.lc_ДинамическиеПоказателиЛицевыхСчетов.СрезПоследних(&Период, ) КАК ДинамическиеПоказателиЛицевыхСчетов
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ВидыТарифовПотребителейЛицевыхСчетов.ЛицевойСчет КАК ЛицевойСчет,
        |	ВидыТарифовПотребителейЛицевыхСчетов.ВидТарифаПотребителя КАК ВидТарифаПотребителя
        |ПОМЕСТИТЬ ВТ_ВидыТарифовПотребителейЛицевыхСчетов
        |ИЗ
        |	РегистрСведений.ГП_ВидыТарифовПотребителейЛицевыхСчетов.СрезПоследних(&Период, ) КАК ВидыТарифовПотребителейЛицевыхСчетов
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ЕСТЬNULL(ВТ_ДинамическиеПоказателиЛицевыхСчетов.ЛицевойСчет, ВТ_ВидыТарифовПотребителейЛицевыхСчетов.ЛицевойСчет) КАК ЛицевойСчет,
        |	ВТ_ДинамическиеПоказателиЛицевыхСчетов.ВидПотребления КАК ВидПотребления,
        |	ВТ_ДинамическиеПоказателиЛицевыхСчетов.СпособФинансирования КАК СпособФинансирования,
        |	ВТ_ДинамическиеПоказателиЛицевыхСчетов.Водозабор КАК Водозабор,
        |	ВТ_ДинамическиеПоказателиЛицевыхСчетов.Договородержатель КАК Договородержатель,
        |	ВТ_ДинамическиеПоказателиЛицевыхСчетов.Контролер КАК Контролер,
        |	ВТ_ДинамическиеПоказателиЛицевыхСчетов.Характеристика КАК Характеристика,
        |	ВТ_ВидыТарифовПотребителейЛицевыхСчетов.ВидТарифаПотребителя КАК ВидТарифаПотребителя
        |ПОМЕСТИТЬ ВТ_СоставнаяТаблицаДинамическихПоказателей
        |ИЗ
        |    ВТ_ДинамическиеПоказателиЛицевыхСчетов КАК ВТ_ДинамическиеПоказателиЛицевыхСчетов
        |        ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ВидыТарифовПотребителейЛицевыхСчетов КАК ВТ_ВидыТарифовПотребителейЛицевыхСчетов
        |        ПО ВТ_ДинамическиеПоказателиЛицевыхСчетов.ЛицевойСчет = ВТ_ВидыТарифовПотребителейЛицевыхСчетов.ЛицевойСчет
        |;";

    Запрос.УстановитьПараметр("Период", Период);
    РезультатЗапроса = Запрос.Выполнить();

    Если МВТ <> Неопределено Тогда
        РезультатФункции = МВТ;
    Иначе
        РезультатФункции = РезультатЗапроса.Выгрузить();
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
